// "use client";
// import { setMultipleDescriptionTask } from "@/redux/features/AI-intrigratoin/aiFileDataSlice";
// import { RootState } from "@/redux/store";
// import { Header } from "antd/es/layout/layout";
// import { useRouter } from "next/navigation";
// import { useState } from "react";
// import { GoDotFill } from "react-icons/go";
// import { useDispatch, useSelector } from "react-redux";
// import SelectOption from "../service/sub-category/SelectOption";
// import PrimaryButton from "@/components/shared/primaryButton/PrimaryButton";

// // interface SubcategoryOption {
// //   id: string;
// //   label: string;
// //   selected?: boolean;
// //   description?: string;
// // }


// interface Category {
//   id: string;
//   title: string;
//   description?: string;
//   options: SubcategoryOption[];
// }

// interface SubcategoryOption {
//   id: string;
//   label: string;
//   selected?: boolean;
//   description?: string;
//   showDesc?: boolean;
// }

// const DescriptionTask = () => {
//   const stepByStepData: any = useSelector((state: RootState) => state.aiData);
//   const subcategoryTitle = stepByStepData.subcategory;
//   const allSubmergedArray = Object.values(subcategoryTitle).flat();
//   console.log(allSubmergedArray, 'subcategoryTitle==============')

//   const [description, setDescription] = useState<Category[]>([

//     // This is subcategory 6
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΕΣΠΕΡΙΚΕΣ_ΔΙΑΡΡΥΜΙΣΕΙΣ_6"
//     ) ? [
//       {
//         id: "Αποξηλώσεις_Καθαιρέσεις_1",
//         title: "Αποξηλώσεις / Καθαιρέσεις",

//         options: [
//           {
//             id: "Καθαίρεση εσωτερικών τοιχοποιιών και απομάκρυνση μπαζών",
//             label: "Καθαίρεση εσωτερικών τοιχοποιιών και απομάκρυνση μπαζών",
//             description:
//               "Αποξήλωση τοιχοποιιών από τούβλο ή γυψοσανίδα, απομάκρυνση μπαζών και καθαρισμός χώρου. Περιλαμβάνει χρήση κοπτικών εργαλείων και προστασία γειτονικών κατασκευών.",
//           },
//           {
//             id: "Αποξηλώσεις υφιστάμενων εσωτερικών κουφωμάτων/πορτών, ντουλαπιών κουζίνας και ντουλαπών",
//             label:
//               "Αποξηλώσεις υφιστάμενων εσωτερικών κουφωμάτων/πορτών, ντουλαπιών κουζίνας και ντουλαπών",
//             description:
//               "Αφαίρεση με προσοχή για ελαχιστοποίηση φθορών, απομάκρυνση από τον χώρο και καθαρισμός υπολειμμάτων.",
//           },
//           {
//             id: "Αποξηλώσεις πλακιδίων σε δάπεδα/τοιχους λουτρού–WC",
//             label: "Αποξηλώσεις πλακιδίων σε δάπεδα/τοιχους λουτρού–WC",
//             description:
//               "Χρήση εργαλείων αποκόλλησης, προστασία σωληνώσεων και κατασκευών, καθαρισμός και απόρριψη υλικών.",
//           },
//           {
//             id: "Αποξηλώσεις παλαιών ειδών υγιεινής",
//             label: "Αποξηλώσεις παλαιών ειδών υγιεινής",
//             description:
//               "Αποσύνδεση και απομάκρυνση λεκάνης, νιπτήρα, μπανιέρας ή καμπίνας, με ασφαλή τρόπο, χωρίς πρόκληση φθοράς σε δίκτυα ύδρευσης/αποχέτευσης.",
//           },
//         ],
//       },
//       {
//         id: "Οικοδομικές–Δομικές Εργασίες_2",
//         title: "Οικοδομικές – Δομικές Εργασίες",

//         options: [
//           {
//             id: "Αλλαγή Χρήσης Χώρου",
//             label: "Αλλαγή Χρήσης Χώρου",
//             description:
//               "Η παραπάνω αφορά την τροποποίηση της χρήσης του χώρου …………………… (π.χ. ισόγειου αποθηκευτικού χώρου με εμβαδόν … τ.μ.), ο οποίος βάσει της εγκεκριμένης οικοδομικής άδειας ………/……… φέρει χρήση …………………… (π.χ. αποθήκης/χώρου στάθμευσης) και βρίσκεται στον …………………… (όροφο/ισόγειο/υπόγειο), με αυτόνομη πρόσβαση μέσω …………………… (π.χ. ιδιωτικής εισόδου ή κοινόχρηστων χώρων). Η κατασκευή του χώρου είναι σύμφωνη με την εγκεκριμένη στατική και αρχιτεκτονική μελέτη της άδειας. Η προτεινόμενη αλλαγή χρήσης αφορά τη μετατροπή του σε …………………… (π.χ. κατοικία, κατάστημα κλπ.), χωρίς επέμβαση στον φέροντα οργανισμό ή τροποποίηση του εξωτερικού όγκου και των όψεων του κτιρίου, ενώ η νέα χρήση είναι πλήρως συμβατή με τις θεσμοθετημένες χρήσεις γης της περιοχής.",
//           },
//           {
//             id: "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
//             label:
//               "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
//             description:
//               "Επιδιορθώσεις τοίχων, εφαρμογή σοβά για ευθυγράμμιση επιφανειών, στοκάρισμα αρμών και ατελειών με υλικά κατάλληλα για βάψιμο ή επικάλυψη",
//           },
//           {
//             id: "Γεμίσματα δαπέδων",
//             label: "Γεμίσματα δαπέδων",
//             description:
//               "dΣτρώση γεμισμάτων για εξισορρόπηση υψομετρικών διαφορών ή απόκρυψη εγκαταστάσεων. Εφαρμογή με ελαφρομπετόν ή τσιμεντοκονία, επιπέδωση και φινίρισμα.",
//           },
//           {
//             id: "Κατασκευή από ξηρά δόμηση – Χώρισμα 1+1, Επένδυση 0+1 σε τοιχοποία και Οροφή από γυψοσανίδα",
//             label:
//               "Κατασκευή από ξηρά δόμηση – Χώρισμα 1+1, Επένδυση 0+1 σε τοιχοποία και Οροφή από γυψοσανίδα",
//             description:
//               "Κατασκευή χωρισμάτων με μεταλλικό σκελετό και γυψοσανίδα, πλήρωση με υλικά ηχομόνωσης. Οροφές με σκελετό και ανάρτηση, φινίρισμα με αρμόστοκο.",
//           },
//         ],
//       },
//       {
//         id: " Ηλεκτρομηχανολογικές Εργασίες (Η/Μ)_3",
//         title: " Ηλεκτρομηχανολογικές Εργασίες (Η/Μ)",
//         options: [
//           {
//             id: "Ηλεκτρολογικές εργασίες",
//             label: "Ηλεκτρολογικές εργασίες",
//             description:
//               "Νέες καλωδιώσεις σε υπάρχουσες ή νέες οδεύσεις, τοποθέτηση πριζών, διακοπτών, παροχών ρεύματος και πίνακα, βάσει προδιαγραφών ασφαλείας.",
//           },
//           {
//             id: "Υδραυλικές εργασίες",
//             label: "Υδραυλικές εργασίες",
//             description:
//               "Νέες σωληνώσεις παροχής και αποχέτευσης σε χώρο λουτρού/WC και κουζίνας, σύνδεση με υπάρχον δίκτυο, τοποθέτηση νέων ειδών υγιεινής, σιφώνια, νιπτήρες, καζανάκια κ.ά.",
//           },
//           {
//             id: "Τοποθέτηση και μετακίνηση σωμάτων καλοριφέρ",
//             label: "Τοποθέτηση και μετακίνηση σωμάτων καλοριφέρ",
//             description:
//               "Αποσύνδεση/τοποθέτηση νέων σωμάτων, μεταφορά σημείων βάσει μελέτης, νέες σωληνώσεις και υδραυλικές συνδέσεις, εξαερώσεις και δοκιμή.",
//           },
//           {
//             id: "Θέρμανση / Ψύξη – Κλιματισμός",
//             label: "Θέρμανση / Ψύξη – Κλιματισμός",
//             description:
//               "Τοποθέτηση κλιματιστικών (split unit, πολυδιαιρούμενα), προκαλωδίωση & σωληνώσεις ψυκτικού υγρού (χωνευτά), αντικατάσταση λεβητοστασίου ή μετάβαση σε αντλία θερμότητας, τοποθέτηση θερμοστατών – ζωνών θέρμανσης.",
//           },
//         ],
//       },
//       {
//         id: "Εργασίες Δαπέδων / Επιφανειών_4",
//         title: "Εργασίες Δαπέδων / Επιφανειών",

//         options: [
//           {
//             id: "Τρίψιμο και γυάλισμα ξύλινου παρκέ",
//             label: "Τρίψιμο και γυάλισμα ξύλινου παρκέ",
//             description:
//               "Λείανση με ειδικά μηχανήματα, στοκάρισμα και εφαρμογή προστατευτικού βερνικιού για ανανέωση της όψης και αντοχής του ξύλινου δαπέδου.",
//           },
//           {
//             id: "Τρίψιμο και γυάλισμα μαρμάρων",
//             label: "Τρίψιμο και γυάλισμα μαρμάρων",
//             description:
//               "Λείανση, στοκάρισμα και κρυσταλλοποίηση μαρμάρινων επιφανειών για αποκατάσταση λάμψης και καθαρότητας επιφάνειας.",
//           },
//           {
//             id: "Τοποθέτηση πλακιδίων σε δάπεδο και τοίχους WC/Κουζίνας",
//             label: "Τοποθέτηση πλακιδίων σε δάπεδο και τοίχους WC/Κουζίνας",
//             description:
//               "Προετοιμασία υποστρώματος, επικόλληση νέων πλακιδίων με κόλλα, αρμολόγηση και καθαρισμός.",
//           },
//         ],
//       },
//       {
//         id: "Χρωματισμοί / Επιχρίσματα_5",
//         title: "Χρωματισμοί / Επιχρίσματα",
//         options: [
//           {
//             id: "Τοποθέτηση νέων κουφωμάτων αλουμινίου στα ίδια ανοίγματα",
//             label: "Τοποθέτηση νέων κουφωμάτων αλουμινίου στα ίδια ανοίγματα",
//             description:
//               "Αποξήλωση παλαιών κουφωμάτων και τοποθέτηση νέων συστημάτων αλουμινίου (παράθυρα, μπαλκονόπορτες) με διπλούς υαλοπίνακες ασφαλείας.",
//           },
//         ],
//       },
//       {
//         id: "Ξυλουργικές Εργασίες – Ντουλάπια / Έπιπλα_6",
//         title: "Ξυλουργικές Εργασίες – Ντουλάπια / Έπιπλα",

//         options: [
//           {
//             id: "Αντικατάσταση ξύλινων επιφανειών στην κουζίνα",
//             label: "Αντικατάσταση ξύλινων επιφανειών στην κουζίνα",
//             description: "",
//           },
//           {
//             id: "Τοποθέτηση νέων εσωτερικών κουφωμάτων (πόρτες MDF/laminate)",
//             label: "Τοποθέτηση νέων εσωτερικών κουφωμάτων (πόρτες MDF/laminate)",
//             description: "",
//           },
//           {
//             id: "Νέες ντουλάπες υπνοδωματίων",
//             label: "Νέες ντουλάπες υπνοδωματίων",
//             description: "",
//           },
//         ],
//       },
//       {
//         id: "Χρωματισμοί / Επιχρίσματα_7",
//         title: "Χρωματισμοί / Επιχρίσματα",

//         options: [
//           {
//             id: "Εσωτερικοί χρωματισμοί",
//             label: "Εσωτερικοί χρωματισμοί",
//             description:
//               "Στοκάρισμα και τρίψιμο επιφανειών, εφαρμογή αστάρι και δύο χεριών βαφή σε τοίχους και ταβάνια με πλαστικό ή ακρυλικό χρώμα.",
//           },
//           {
//             id: "Εξωτερικοί χρωματισμοί",
//             label: "Εξωτερικοί χρωματισμοί",
//             description:
//               "Στοκάρισμα και τρίψιμο επιφανειών, εφαρμογή αστάρι και δύο χεριών βαφή σε τοίχους και ταβάνια με πλαστικό ή ακρυλικό χρώμα.",
//           },
//         ],
//       },
//       {
//         id: "Σκίαση / Εξοπλισμός_8",
//         title: "Σκίαση / Εξοπλισμός",
//         options: [
//           {
//             id: "Τοποθέτηση σκιάστρων / τεντών",
//             label: "Τοποθέτηση σκιάστρων / τεντών",
//             description:
//               "Προμήθεια και τοποθέτηση τεντών ή σκιάστρων, με βραχίονες ή κάθετα συστήματα, χειροκίνητα ή ηλεκτροκίνητα. Στερέωση σε τοίχους ή οροφή με κατάλληλα στηρίγματα, τοποθέτηση κασετίνας όπου απαιτείται, ρύθμιση μηχανισμών κίνησης και δοκιμαστική λειτουργία. Δυνατότητα ενσωμάτωσης αισθητήρων (ήλιος–άνεμος) και αυτοματισμών για βελτιστοποίηση σκίασης.",
//           },
//         ],
//       },
//     ] : []),

//     // This is subcategory 5 
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΔΑΧΤΥΛΙΔΙΩΝ_ΟΠΙΣΘΙΟΠΟΙΗΣΗΣ_ΙΟΚΘΕΙΑΣ_5"
//     ) ? [
//       {
//         id: "Ικριώματα – Συμπληρωματικές Εργασίες",
//         title: "Ικριώματα – Συμπληρωματικές Εργασίες",

//         options: [
//           {
//             id: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
//             label: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
//             description:
//               "Εγκατάσταση μεταλλικών ικριωμάτων κατά μήκος των όψεων, σύμφωνα με νομοθεσία περί μέτρων ασφαλείας. Διασφαλίζεται πλήρης και ασφαλής πρόσβαση για εργασίες αποκατάστασης και χρωματισμού.",
//           },
//         ],
//       },

//       {
//         id: "Οικοδομικές–Δομικές Εργασίες",
//         title: "Οικοδομικές – Δομικές Εργασίες",

//         options: [
//           {
//             id: "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
//             label:
//               "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
//             description:
//               "Αποκατάσταση φθαρμένων ή αποσαθρωμένων επιχρισμάτων εξωτερικής τοιχοποιίας. Περιλαμβάνει καθαίρεση σαθρών επιχρισμάτων, εφαρμογή νέου σοβά, στοκάρισμα ρωγμών και λείανση επιφανειών, χωρίς επέμβαση στον φέροντα οργανισμό ή στη γεωμετρία του κτιρίου.",
//           },
//           {
//             id: "Επισκευή και στερέωση μαρμάρινων στοιχείων (π.χ. περβαζιών, στηθαίων)",
//             label: "Επισκευή και στερέωση μαρμάρινων στοιχείων (π.χ. περβαζιών, στηθαίων)",
//             description:
//               "Επαναστερέωση ή αντικατάσταση φθαρμένων/αποκολλημένων μαρμάρινων επιστρώσεων στις όψεις, με χρήση αγκυρίων ή κόλλας εξωτερικής χρήσης. Οι αρμοί σφραγίζονται με σιλικονούχα ή πολυουρεθανική μαστίχη για αποτροπή υγρασίας.",
//           },
//           {
//             id: "Αποκατάσταση στοιχείων απορροής όμβριων και μεταλλικών εξαρτημάτων",
//             label:
//               "Αποκατάσταση στοιχείων απορροής όμβριων και μεταλλικών εξαρτημάτων",
//             description:
//               "Έλεγχος και αποκατάσταση ή αντικατάσταση φθαρμένων υδρορροών, στομίων, καναλιών ή σταγονόδρομων από λαμαρίνα ή συνθετικά υλικά. Στόχος η αποκατάσταση της λειτουργικής απορροής όμβριων και η προστασία των όψεων από υγρασία.",
//           },
//         ],
//       },

//       {
//         id: "Χρωματισμοί / Επιχρίσματα_3",
//         title: "Χρωματισμοί / Επιχρίσματα",

//         options: [
//           {
//             id: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             label: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             description:
//               "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
//           },
//           {
//             id: "Χρωματισμός μεταλλικών κιγκλιδωμάτων (σιδηρών στοιχείων)",
//             label: "Χρωματισμός μεταλλικών κιγκλιδωμάτων (σιδηρών στοιχείων)",
//             description: "Καθαρισμός, αποσκουριάσμα και βαφή κιγκλιδωμάτων (κάγκελα, εξώστες, αυλόπορτες) με αντιδιαβρωτικό υπόστρωμα και δύο στρώσεις τελικής βαφής με χρώμα μετάλλου εξωτερικής χρήσης. Δεν μεταβάλλεται η μορφή ή ο χαρακτήρας του"
//           },

//         ],
//       },
//     ] : []),

//     // This is subcategory 10 
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΝΕΑ_ΑΝΟΙΞΜΑΤΑ_ΕΠΙ_ΤΩΝ_ΟΙΚΕΩΝ_10"
//     ) ? [
//       {
//         id: "Αποξηλώσεις / Καθαιρέσεις",
//         title: "Αποξηλώσεις / Καθαιρέσεις",
//         options: [
//           {
//             id: "Κατεδάφιση/Αποξήλωση Υφιστάμενων Τοιχοπληρώσεων (μη φερόντων στοιχείων)",
//             label: "Κατεδάφιση/Αποξήλωση Υφιστάμενων Τοιχοπληρώσεων (μη φερόντων στοιχείων)",
//             description:
//               "Τοπική καθαίρεση τμημάτων εξωτερικών περιμετρικών τοιχοποιιών (οπτοπλινθοδομές ή άλλα υλικά πλήρωσης), χωρίς επέμβαση στον φέροντα οργανισμό (π.χ. δοκούς, υποστυλώματα).",
//           },
//         ],
//       },

//       {
//         id: "Οικοδομικές–Δομικές Εργασίες",
//         title: "Οικοδομικές – Δομικές Εργασίες",
//         options: [
//           {
//             id: "Δημιουργία Νέων Ανοιγμάτων (Παράθυρα / Πόρτες / Βιτρίνες)",
//             label:
//               "Δημιουργία Νέων Ανοιγμάτων (Παράθυρα / Πόρτες / Βιτρίνες)",
//             description:
//               "Διάνοιξη νέων ανοιγμάτων με κατάλληλες λεπτομέρειες στήριξης και περιμετρικής ενίσχυσης (π.χ. γωνιόκρανα, μεταλλικά πλαίσια, αν χρειάζεται).Τοποθέτηση νέων κουφωμάτων(αλουμινίου, PVC ή ξύλου) στις νέες θέσεις.",
//           },
//           {
//             id: "Μετατόπιση ή Τροποποίηση Υφιστάμενων Ανοιγμάτων",
//             label: "Μετατόπιση ή Τροποποίηση Υφιστάμενων Ανοιγμάτων",
//             description:
//               "Κατάργηση ή μετατόπιση παλαιών κουφωμάτων.Επαναδιαμόρφωση του κελύφους με επισκευές τοιχοποιίας και αποκατάσταση επιχρισμάτων.",
//           },
//           {
//             id: "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
//             label:
//               "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
//             description:
//               "Αφορά την αποκατάσταση φθαρμένων ή αποσαθρωμένων επιχρισμάτων εξωτερικής τοιχοποιίας. Περιλαμβάνονται καθαίρεση σαθρών επιχρισμάτων, εφαρμογή νέου σοβά, στοκάρισμα ρωγμών και λείανση επιφανειών, χωρίς επέμβαση στον φέροντα οργανισμό ή στη γεωμετρία του κτιρίου.",
//           },
//         ],
//       },

//       {
//         id: "Χρωματισμοί / Επιχρίσματα",
//         title: "Χρωματισμοί / Επιχρίσματα",
//         options: [
//           {
//             id: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             label: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             description:
//               "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
//           },
//         ]
//       },
//     ] : []),

//     // This is subcategory 14
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΛΙΜΑΚΑΣ_ΣΥΝΤΗΡΗΣΗ_ΚΑΙ_ΕΠΙΣΚΕΥΗ_ΣΤΕΓΩΝ_ΜΕ_ΧΡΗΣΗ_ΙΚΡΙΩΜΑ_14"
//     ) ? [
//       {
//         id: "Ικριώματα – Συμπληρωματικές Εργασίες",
//         title: "Ικριώματα – Συμπληρωματικές Εργασίες",
//         options: [
//           {
//             id: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
//             label: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
//             description:
//               "Εγκατάσταση μεταλλικών ικριωμάτων κατά μήκος των όψεων, σύμφωνα με τη νομοθεσία περί μέτρων ασφαλείας. Διασφαλίζεται ασφαλής και πλήρης πρόσβαση για εργασίες αποκατάστασης και χρωματισμού.",
//           },
//         ],
//       },
//       {
//         id: "Αποξηλώσεις / Καθαιρέσεις",
//         title: "Αποξηλώσεις / Καθαιρέσεις",
//         options: [
//           {
//             id: "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
//             label:
//               "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
//             description:
//               "Αφαίρεση κεραμιδιών και παλιών υποστρωμάτων (π.χ. φύλλα ασφαλτικών μεμβρανών, ελαφρομπετά).",
//           },
//           {
//             id: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
//             label: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
//             description:
//               "Απομάκρυνση φθαρμένων εξαρτημάτων για αποκατάσταση της απορροής ομβρίων.",
//           }
//         ]
//       },
//       {
//         id: "Οικοδομικές – Δομικές Εργασίες",
//         title: "Οικοδομικές – Δομικές Εργασίες",
//         options: [
//           {
//             id: "Έλεγχος & αποκατάσταση φθαρμένων υλικών",
//             label:
//               "Έλεγχος & αποκατάσταση φθαρμένων υλικών",
//             description:
//               "Ανίχνευση και αντικατάσταση φθαρμένων στοιχείων της στέγης (κεραμίδια, επικάλυψη, υδρορροές, στηρίγματα).",
//           },
//           {
//             id: "Επισκευή φέροντος ξύλινου σκελετού",
//             label: "Επισκευή φέροντος ξύλινου σκελετού",
//             description:
//               "Απομάκρυνση φθαρμένων εξαρτημάτων για αποκατάσταση της απορροής ομβρίων.",
//           },
//           {
//             id: "Στεγανοποίηση – Υδατοστεγανότητα",
//             label: "Στεγανοποίηση – Υδατοστεγανότητα",
//             description: "Τοποθέτηση νέων μεμβρανών στεγανοποίησης, αντικατάσταση υδρορροών και σφράγιση κρίσιμων σημείων (π.χ. καμινάδες, φωταγωγοί).",
//           }
//         ]
//       },
//       {

//         id: "Χρωματισμοί / Επιχρίσματα",
//         title: "Χρωματισμοί / Επιχρίσματα",
//         options: [
//           {
//             id: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             label: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             description:
//               "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
//           },
//         ]
//       },
//       {
//         id: "Στέγες – Συμπληρωματικές Εργασίες",
//         title: "Στέγες – Συμπληρωματικές Εργασίες,",
//         options: [
//           {
//             id: "Καθαρισμός υδρορροών & συστήματος απορροής",
//             label: "Καθαρισμός υδρορροών & συστήματος απορροής",
//             description:
//               "Απομάκρυνση φερτών υλικών και σωμάτων από υδρορροές και υδροσυλλέκτες.",
//           },
//           {
//             id: "Τοποθέτηση νέας επικάλυψης στέγης",
//             label: "Τοποθέτηση νέας επικάλυψης στέγης",
//             description:
//               "Τοποθέτηση νέων κεραμιδιών ή άλλης εγκεκριμένης επικάλυψης, με σωστή στερέωση και εφαρμογή μεμβράνης.",
//           },
//           {
//             id: "Εφαρμογή προστατευτικών επιστρώσεων",
//             label: "Εφαρμογή προστατευτικών επιστρώσεων",
//             description:
//               "Τοπική ή συνολική εφαρμογή ελαστομερούς υδατοστεγανωτικής βαφής.",
//           }
//         ]
//       },
//     ] : []),

//     // This is subcategory 2 
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΑΝΑΚΑΤΑΣΚΕΥΗ_ΥΠΕΡΗΧΩΝ_2"
//     ) ? [
//       {
//         id: "Αποξηλώσεις / Καθαιρέσεις",
//         title: "Αποξηλώσεις / Καθαιρέσεις",
//         options: [
//           {
//             id: "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
//             label:
//               "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
//             description:
//               "Αφαίρεση κεραμιδιών και παλιών υποστρωμάτων (π.χ. φύλλα ασφαλτικών μεμβρανών, ελαφρομπετά).",
//           },
//           {
//             id: "Αποξήλωση υποστρώσεων επικάλυψης",
//             label: "Αποξήλωση υποστρώσεων επικάλυψης",
//             description:
//               "Αφαίρεση υποστρώσεων (π.χ. παλιά ελαφρομπετά, φύλλα ασφαλτικών μεμβρανών κ.λπ.) όπου απαιτείται..",
//           },
//           {
//             id: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
//             label: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
//             description:
//               "Απομάκρυνση φθαρμένων εξαρτημάτων για αποκατάσταση της απορροής ομβρίων.",
//           }
//         ]
//       },
//       {
//         id: "Οικοδομικές – Δομικές Εργασίες",
//         title: "Οικοδομικές – Δομικές Εργασίες",

//         options: [
//           {
//             id: "Επισκευή Φέροντος Ξύλινου Σκελετού",
//             label:
//               "Επισκευή Φέροντος Ξύλινου Σκελετού",
//             description:
//               "Αντικατάσταση σάπιων ή φθαρμένων τμημάτων (ζευκτών, τεγίδων, δοκαριών) χωρίς αλλαγή στη γεωμετρία και στη στατική δομή.Εφαρμογή αντισηπτικών και προστατευτικών υλικών στα νέα και στα υπάρχοντα ξύλινα στοιχεία.",
//           },
//           {
//             id: "Στεγανοποίηση – Υδατοστεγανότητα",
//             label: "Στεγανοποίηση – Υδατοστεγανότητα",
//             description:
//               "Εφαρμογή νέων ασφαλτικών μεμβρανών ή άλλων σύγχρονων υλικών στεγανοποίησης, στεγανοποίηση αρμών και κρίσιμων σημείων διέλευσης (π.χ. καμινάδες, φωταγωγοί), προσθήκη ή αντικατάσταση υδρορροών/καναλιών απορροής.",
//           }
//         ]
//       },
//       {
//         id: "Χρωματισμοί / Επιχρίσματα",
//         title: "Χρωματισμοί / Επιχρίσματα",
//         options: [
//           {
//             id: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             label: "Εξωτερικοί χρωματισμοί επί των όψεων",
//             description:
//               "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
//           },
//         ]
//       },
//       {
//         id: "Στέγες – Συμπληρωματικές Εργασίες",
//         title: "Στέγες – Συμπληρωματικές Εργασίες,",
//         options: [
//           {
//             id: "Καθαρισμός υδρορροών & συστήματος απορροής",
//             label: "Καθαρισμός υδρορροών & συστήματος απορροής",
//             description:
//               "Απομάκρυνση φερτών υλικών και σωμάτων από υδρορροές και υδροσυλλέκτες.",
//           },
//           {
//             id: "Τοποθέτηση νέας επικάλυψης στέγης",
//             label: "Τοποθέτηση νέας επικάλυψης στέγης",
//             description:
//               "Τοποθέτηση νέων κεραμιδιών ή άλλης εγκεκριμένης επικάλυψης, με σωστή στερέωση και εφαρμογή μεμβράνης.",
//           },
//           {
//             id: "Εφαρμογή προστατευτικών επιστρώσεων",
//             label: "Εφαρμογή προστατευτικών επιστρώσεων",
//             description:
//               "Τοπική ή συνολική εφαρμογή ελαστομερούς υδατοστεγανωτικής βαφής.",
//           }
//         ]
//       },
//     ] : []),

//     // This is subcategory 7
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΕΡΜΟΠΡΟΖΩΗΣ_7"
//     ) ? [
//       {
//         id: "Οικοδομικές – Δομικές Εργασίες",
//         title: "Οικοδομικές – Δομικές Εργασίες",
//         options: [
//           {
//             id: "Εξωτερική θερμομόνωση με διογκωμένη πολυστερίνη",
//             label:
//               "Εξωτερική θερμομόνωση με διογκωμένη πολυστερίνη",
//             description:
//               "Η εργασία αφορά την εφαρμογή εξωτερικής θερμομόνωσης στο κέλυφος του κτιρίου με πλάκες διογκωμένης πολυστερίνης (XPS) υψηλής πυκνότητας (≥30 kg/m³), πάχους 5–10 cm, σύμφωνα με τις απαιτήσεις του ΚΕΝΑΚ και της ΤΟΤΕΕ 20701-2/2017. Οι πλάκες επικολλούνται επί του υφιστάμενου υποστρώματος με τσιμεντοειδή κόλλα και επιπλέον στερεώνονται μηχανικά με πλαστικά βύσματα αγκύρωσης ανά 5 τεμάχια/m². Ακολουθεί εφαρμογή βασικής στρώσης οπλισμού με υαλόπλεγμα αλκαλίμαχο βάρους 160 g/m², ενσωματωμένο σε ρητινούχο κονίαμα πάχους περίπου 3 mm. Στις γωνίες, ανοίγματα και τελειώματα τοποθετούνται ειδικά προφίλ (γωνιόκρανα, νεροσταλάκτες, αρμοκάλυπτρα) για προστασία και ομοιομορφία. Ως τελική επιφάνεια εφαρμόζεται ακρυλικός ή σιλικονούχος σοβάς πάχους 1,5–2 mm, ανθεκτικός σε υπεριώδη ακτινοβολία και καιρικές καταπονήσεις, ώστε να εξασφαλίζεται υψηλή ενεργειακή απόδοση, στεγανότητα και αισθητική ομοιομορφία της όψης.",

//           },
//         ]
//       },
//       {

//         id: "Συστήματα Παθητικής Ηλιακής Προστασίας και Ενεργειακής Αναβάθμισης Κελύφους",
//         title: "Συστήματα Παθητικής Ηλιακής Προστασίας και Ενεργειακής Αναβάθμισης Κελύφους",
//         options: [
//           {
//             id: "Εφαρμογή Παθητικών Ηλιακών Συστημάτων",
//             label: "Εφαρμογή Παθητικών Ηλιακών Συστημάτων",
//             description:
//               "Τοποθέτηση σταθερών σκιάστρων (μεταλλικών ή ξύλινων) στις όψεις του κτιρίου και εφαρμογή ανακλαστικών επιστρώσεων σε δομικά στοιχεία ή σε υαλοστάσια (όπου απαιτείται), με στόχο τη βελτίωση της ενεργειακής απόδοσης και της θερμικής άνεσης.",
//           },
//         ]
//       },
//     ] : []),

//     // This is subcategory 8
//     ...(allSubmergedArray.includes(
//       "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΚΟΙΝΗ_ΔΡΑΣΗ_ΕΝΤΟΣ_ΟΙΚΟΠΕΔΟΥ_8"
//     ) ? [
//       {
//         id: "Κοπή Δέντρων",
//         title: "Κοπή Δέντρων",
//         options: [
//           {
//             id: "Κοπή Δέντρων λόγω Στατικής Επικινδυνότητας",
//             label: "Κοπή Δέντρων λόγω Στατικής Επικινδυνότητας",
//             description: "Η εργασία αφορά την κοπή δέντρων τα οποία παρουσιάζουν έντονα φαινόμενα στατικής ανεπάρκειας, όπως σοβαρή κλίση, σήψη του κορμού ή αποσάθρωση του ριζικού τους συστήματος, γεγονός που αυξάνει τον κίνδυνο πτώσης και πιθανής πρόκλησης ζημιών σε γειτονικά κτίρια, κοινόχρηστους χώρους ή διερχόμενους.",
//           },
//           {
//             id: "Κοπή Δέντρων λόγω Πρόκλησης Βλαβών σε Υποδομές και Δίκτυα",
//             label: "Κοπή Δέντρων λόγω Πρόκλησης Βλαβών σε Υποδομές και Δίκτυα",
//             description: "Η κοπή κρίνεται αναγκαία καθώς παρατηρούνται φαινόμενα ρηγματώσεων σε τοιχία περίφραξης, αποκόλληση πλακοστρώσεων και παραμορφώσεις δαπέδων, εξαιτίας της υπερβολικής ανάπτυξης του ριζικού συστήματος των δέντρων. Επιπλέον, έχουν καταγραφεί φθορές σε υπόγεια δίκτυα αποχέτευσης και ύδρευσης.",
//           },
//           {
//             id: "Κοπή Δέντρων για Διασφάλιση Επαρκούς Φωτισμού και Αερισμού",
//             label: "Κοπή Δέντρων για Διασφάλιση Επαρκούς Φωτισμού και Αερισμού",
//             description: "Η εργασία αφορά την απομάκρυνση δέντρων που δημιουργούν σοβαρά προβλήματα σκίασης και παρεμπόδισης φυσικού αερισμού σε κύριους χώρους διαβίωσης εντός του κτιρίου, γεγονός που επηρεάζει αρνητικά την υγιεινή και την ποιότητα ζωής των ενοίκων, σε αντίθεση με τις απαιτήσεις του Κτιριοδομικού Κανονισμού.",
//           },
//           {
//             id: "Κοπή Δέντρων λόγω Εκτέλεσης Εγκεκριμένων Οικοδομικών Εργασιών",
//             label: "Κοπή Δέντρων λόγω Εκτέλεσης Εγκεκριμένων Οικοδομικών Εργασιών",
//             description: "Η κοπή αφορά δέντρα που βρίσκονται εντός των ζωνών επέμβασης για προγραμματισμένες εργασίες μικρής κλίμακας, όπως η τοποθέτηση δεξαμενής, κατασκευή ράμπας ή άλλων βοηθητικών υποδομών. Η απομάκρυνσή τους είναι απαραίτητη για την ασφαλή και ορθή εκτέλεση των εργασιών.",
//           },
//           {
//             id: "Κοπή Δέντρων για Πυροπροστασία",
//             label: "Κοπή Δέντρων για Πυροπροστασία",
//             description: "Η εργασία αφορά την απομάκρυνση δέντρων που βρίσκονται σε άμεση γειτνίαση με τα κτίρια του οικοπέδου, σε απόσταση μικρότερη των 3 έως 5 μέτρων από τα δομικά στοιχεία, όπως καθορίζεται από τις προβλέψεις του Κανονισμού Πυροπροστασίας Κτιρίων (ΦΕΚ 2434/Β/2018) και τις γενικές οδηγίες πυροπροστασίας της Πολιτικής Προστασίας.Η ανάγκη κοπής των συγκεκριμένων δέντρων τεκμηριώνεται λόγω της αυξημένης επικινδυνότητας πρόκλησης και εξάπλωσης πυρκαγιάς, ειδικά κατά τους θερινούς μήνες. Τα δέντρα αυτά, λόγω του μεγάλου ύψους, της πυκνής κόμης και της άμεσης επαφής με τις όψεις των κτιρίων, λειτουργούν ως πιθανός αγωγός φλόγας σε περίπτωση πυρκαγιάς, αυξάνοντας τον κίνδυνο μετάδοσης της φωτιάς από το έδαφος προς το κτίριο ή από κτίριο σε κτίριο.Επιπλέον, ορισμένα από τα δέντρα παρουσιάζουν συσσώρευση ξερών φύλλων, κλαδιών και οργανικών υπολειμμάτων τόσο στο ριζικό τους σύστημα όσο και εντός της κόμης τους, δημιουργώντας υψηλό φορτίο καύσιμης ύλης.Η απομάκρυνση των δέντρων αυτών εντάσσεται σε ευρύτερη στρατηγική προληπτικής πυροπροστασίας, η οποία περιλαμβάνει:Δημιουργία ελεύθερης ζώνης απαλλαγμένης από εύφλεκτη βλάστηση γύρω από τα κτίρια.Διασφάλιση της δυνατότητας πρόσβασης πυροσβεστικών μέσων σε περίπτωση ανάγκης.Ελαχιστοποίηση του κινδύνου φλόγας από έρπουσα ή υφέρπουσα πυρκαγιά.Συμμόρφωση με τις οδηγίες της Πυροσβεστικής Υπηρεσίας και τις απαιτήσεις των εγκεκριμένων μελετών πυροπροστασίας (όπου υπάρχουν).Η κοπή των δέντρων θα γίνει με κατάλληλα μέσα, με μέριμνα για την προστασία της ανθρώπινης ζωής, των γειτονικών κατασκευών και των παρακείμενων ιδιοκτησιών. Τα προϊόντα κοπής θα απομακρυνθούν άμεσα και θα διατεθούν σύμφωνα με τις ισχύουσες περιβαλλοντικές διατάξεις.",
//           }
//         ]
//       },
//     ] : []),
//   ]);


//   console.log(description, "all description==============")

//   const navigate = useRouter();
//   const dispatch = useDispatch();
//   const aiExtractData = useSelector((state: RootState) => state.aiData);
//   console.log("sub ", aiExtractData);
//   const toggleOption = (categoryId: string, optionId: string) => {
//     setDescription((prevCategories) =>
//       prevCategories.map((category) =>
//         category.id === categoryId
//           ? {
//             ...category,
//             options: category.options.map((option) =>
//               option.id === optionId
//                 ? { ...option, selected: !option.selected }
//                 : option
//             ),
//           }
//           : category
//       )
//     );
//   };

//   //   const handleSave = () => {
//   //     const selectedOptions: { [categoryId: string]: string[] } = {};
//   //     description.forEach((category) => {
//   //       const selected = category.options
//   //         .filter((option) => option.selected)
//   //         .map((option) => option.id);
//   //       if (selected.length > 0) {
//   //         selectedOptions[category.id] = selected;
//   //       }
//   //     });

//   const handleSave = () => {
//     const selectedOptions: {
//       [categoryId: string]: { id: string; description?: string }[];
//     } = {};
//     description.forEach((cat) => {
//       const selected = cat.options
//         .filter((opt) => opt.selected)
//         .map((opt) => ({ id: opt.id, description: opt.description }));
//       if (selected.length > 0) {
//         selectedOptions[cat.id] = selected;
//       }
//     });

//     console.log("Selected options:", selectedOptions);
//     dispatch(setMultipleDescriptionTask(selectedOptions));

//     //Tahsin
//     //need a validation here minimum one select
//     navigate.push("/create-project");
//   };

//   return (
//     <div className={`bg-[#F1F5F9] py-3  min-h-screen`}>
//       <h2 className="text-3xl text-black font-semibold">Description Task</h2>
//       <div className="grid grid-cols-1 lg:grid-cols-2 gap-8 mt-4">
//         {/* Left Column */}
//         <div className="space-y-6">
//           {description
//             .slice(0, Math.ceil(description.length / 2))
//             .map((category) => (
//               <div
//                 key={category.id}
//                 className=" rounded-lg  bg-white border p-5 border-primary"
//               >
//                 <div className="flex items-center gap-3 mb-4">
//                   <h2 className="text-lg font-semibold text-gray-900">
//                     {category.title}
//                   </h2>
//                 </div>

//                 <div className="space-y-3 ">
//                   {category.options.map((option) => (
//                     <SelectOption
//                       key={option.id}
//                       option={option}
//                       categoryId={option.id}
//                       toggleOption={() => toggleOption(category.id, option.id)}
//                     />
//                   ))}
//                 </div>
//               </div>
//             ))}
//         </div>

//         {/* Right Column */}
//         <div className="space-y-6">
//           {description
//             .slice(Math.ceil(description.length / 2))
//             .map((category) => (
//               <div
//                 key={category.id}
//                 className=" rounded-lg p-5 bg-white border  border-primary"
//               >
//                 <div className="flex items-center gap-3 mb-4">
//                   <h2 className="text-lg font-semibold text-gray-900">
//                     {category.title}
//                   </h2>
//                 </div>

//                 <div className="space-y-3">
//                   {category.options.map((option) => (
//                     <SelectOption
//                       key={option.id}
//                       option={option}
//                       categoryId={option.id}
//                       toggleOption={() => toggleOption(category.id, option.id)}
//                     />
//                   ))}
//                 </div>
//               </div>
//             ))}
//         </div>
//       </div>

//       {/* Save Button */}
//       <div className="flex justify-end mt-8 w-fit ml-auto">
//         <PrimaryButton label="Save & Continue" onClick={handleSave} />
//       </div>
//     </div>
//   );
// };

// export default DescriptionTask;






"use client";
import { setMultipleDescriptionTask } from "@/redux/features/AI-intrigratoin/aiFileDataSlice";
import { RootState } from "@/redux/store";
import { Header } from "antd/es/layout/layout";
import { useRouter } from "next/navigation";
import { useState } from "react";
import { GoDotFill } from "react-icons/go";
import { useDispatch, useSelector } from "react-redux";
import SelectOption from "../service/sub-category/SelectOption";
import PrimaryButton from "@/components/shared/primaryButton/PrimaryButton";

// interface SubcategoryOption {
//   id: string;
//   label: string;
//   selected?: boolean;
//   description?: string;
// }


interface Category {
  id: string;
  title: string;
  description?: string;
  options: SubcategoryOption[];
}

interface SubcategoryOption {
  id: string;
  label: string;
  selected?: boolean;
  description?: string;
  showDesc?: boolean;
}

const DescriptionTask = () => {
  const stepByStepData: any = useSelector((state: RootState) => state.aiData);
  const subcategoryTitle = stepByStepData.subcategory;
  const allSubmergedArray = Object.values(subcategoryTitle).flat();
  console.log(allSubmergedArray, 'subcategoryTitle==============')

  let [description, setDescription] = useState<Category[]>([

    // This is subcategory 6
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΕΣΠΕΡΙΚΕΣ_ΔΙΑΡΡΥΜΙΣΕΙΣ_6"
    ) ? [
      {
        id: "Αποξηλώσεις_Καθαιρέσεις_1",
        title: "Αποξηλώσεις / Καθαιρέσεις",

        options: [
          {
            id: "Καθαίρεση εσωτερικών τοιχοποιιών και απομάκρυνση μπαζών",
            label: "Καθαίρεση εσωτερικών τοιχοποιιών και απομάκρυνση μπαζών",
            description:
              "Αποξήλωση τοιχοποιιών από τούβλο ή γυψοσανίδα, απομάκρυνση μπαζών και καθαρισμός χώρου. Περιλαμβάνει χρήση κοπτικών εργαλείων και προστασία γειτονικών κατασκευών.",
          },
          {
            id: "Αποξηλώσεις υφιστάμενων εσωτερικών κουφωμάτων/πορτών, ντουλαπιών κουζίνας και ντουλαπών",
            label:
              "Αποξηλώσεις υφιστάμενων εσωτερικών κουφωμάτων/πορτών, ντουλαπιών κουζίνας και ντουλαπών",
            description:
              "Αφαίρεση με προσοχή για ελαχιστοποίηση φθορών, απομάκρυνση από τον χώρο και καθαρισμός υπολειμμάτων.",
          },
          {
            id: "Αποξηλώσεις πλακιδίων σε δάπεδα/τοιχους λουτρού–WC",
            label: "Αποξηλώσεις πλακιδίων σε δάπεδα/τοιχους λουτρού–WC",
            description:
              "Χρήση εργαλείων αποκόλλησης, προστασία σωληνώσεων και κατασκευών, καθαρισμός και απόρριψη υλικών.",
          },
          {
            id: "Αποξηλώσεις παλαιών ειδών υγιεινής",
            label: "Αποξηλώσεις παλαιών ειδών υγιεινής",
            description:
              "Αποσύνδεση και απομάκρυνση λεκάνης, νιπτήρα, μπανιέρας ή καμπίνας, με ασφαλή τρόπο, χωρίς πρόκληση φθοράς σε δίκτυα ύδρευσης/αποχέτευσης.",
          },
        ],
      },
      {
        id: "Οικοδομικές–Δομικές Εργασίες_2",
        title: "Οικοδομικές – Δομικές Εργασίες",

        options: [
          {
            id: "Αλλαγή Χρήσης Χώρου",
            label: "Αλλαγή Χρήσης Χώρου",
            description:
              "Η παραπάνω αφορά την τροποποίηση της χρήσης του χώρου …………………… (π.χ. ισόγειου αποθηκευτικού χώρου με εμβαδόν … τ.μ.), ο οποίος βάσει της εγκεκριμένης οικοδομικής άδειας ………/……… φέρει χρήση …………………… (π.χ. αποθήκης/χώρου στάθμευσης) και βρίσκεται στον …………………… (όροφο/ισόγειο/υπόγειο), με αυτόνομη πρόσβαση μέσω …………………… (π.χ. ιδιωτικής εισόδου ή κοινόχρηστων χώρων). Η κατασκευή του χώρου είναι σύμφωνη με την εγκεκριμένη στατική και αρχιτεκτονική μελέτη της άδειας. Η προτεινόμενη αλλαγή χρήσης αφορά τη μετατροπή του σε …………………… (π.χ. κατοικία, κατάστημα κλπ.), χωρίς επέμβαση στον φέροντα οργανισμό ή τροποποίηση του εξωτερικού όγκου και των όψεων του κτιρίου, ενώ η νέα χρήση είναι πλήρως συμβατή με τις θεσμοθετημένες χρήσεις γης της περιοχής.",
          },
          {
            id: "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
            label:
              "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
            description:
              "Επιδιορθώσεις τοίχων, εφαρμογή σοβά για ευθυγράμμιση επιφανειών, στοκάρισμα αρμών και ατελειών με υλικά κατάλληλα για βάψιμο ή επικάλυψη",
          },
          {
            id: "Γεμίσματα δαπέδων",
            label: "Γεμίσματα δαπέδων",
            description:
              "dΣτρώση γεμισμάτων για εξισορρόπηση υψομετρικών διαφορών ή απόκρυψη εγκαταστάσεων. Εφαρμογή με ελαφρομπετόν ή τσιμεντοκονία, επιπέδωση και φινίρισμα.",
          },
          {
            id: "Κατασκευή από ξηρά δόμηση – Χώρισμα 1+1, Επένδυση 0+1 σε τοιχοποία και Οροφή από γυψοσανίδα",
            label:
              "Κατασκευή από ξηρά δόμηση – Χώρισμα 1+1, Επένδυση 0+1 σε τοιχοποία και Οροφή από γυψοσανίδα",
            description:
              "Κατασκευή χωρισμάτων με μεταλλικό σκελετό και γυψοσανίδα, πλήρωση με υλικά ηχομόνωσης. Οροφές με σκελετό και ανάρτηση, φινίρισμα με αρμόστοκο.",
          },
        ],
      },
      {
        id: " Ηλεκτρομηχανολογικές Εργασίες (Η/Μ)_3",
        title: " Ηλεκτρομηχανολογικές Εργασίες (Η/Μ)",
        options: [
          {
            id: "Ηλεκτρολογικές εργασίες",
            label: "Ηλεκτρολογικές εργασίες",
            description:
              "Νέες καλωδιώσεις σε υπάρχουσες ή νέες οδεύσεις, τοποθέτηση πριζών, διακοπτών, παροχών ρεύματος και πίνακα, βάσει προδιαγραφών ασφαλείας.",
          },
          {
            id: "Υδραυλικές εργασίες",
            label: "Υδραυλικές εργασίες",
            description:
              "Νέες σωληνώσεις παροχής και αποχέτευσης σε χώρο λουτρού/WC και κουζίνας, σύνδεση με υπάρχον δίκτυο, τοποθέτηση νέων ειδών υγιεινής, σιφώνια, νιπτήρες, καζανάκια κ.ά.",
          },
          {
            id: "Τοποθέτηση και μετακίνηση σωμάτων καλοριφέρ",
            label: "Τοποθέτηση και μετακίνηση σωμάτων καλοριφέρ",
            description:
              "Αποσύνδεση/τοποθέτηση νέων σωμάτων, μεταφορά σημείων βάσει μελέτης, νέες σωληνώσεις και υδραυλικές συνδέσεις, εξαερώσεις και δοκιμή.",
          },
          {
            id: "Θέρμανση / Ψύξη – Κλιματισμός",
            label: "Θέρμανση / Ψύξη – Κλιματισμός",
            description:
              "Τοποθέτηση κλιματιστικών (split unit, πολυδιαιρούμενα), προκαλωδίωση & σωληνώσεις ψυκτικού υγρού (χωνευτά), αντικατάσταση λεβητοστασίου ή μετάβαση σε αντλία θερμότητας, τοποθέτηση θερμοστατών – ζωνών θέρμανσης.",
          },
        ],
      },
      {
        id: "Εργασίες Δαπέδων / Επιφανειών_4",
        title: "Εργασίες Δαπέδων / Επιφανειών",

        options: [
          {
            id: "Τρίψιμο και γυάλισμα ξύλινου παρκέ",
            label: "Τρίψιμο και γυάλισμα ξύλινου παρκέ",
            description:
              "Λείανση με ειδικά μηχανήματα, στοκάρισμα και εφαρμογή προστατευτικού βερνικιού για ανανέωση της όψης και αντοχής του ξύλινου δαπέδου.",
          },
          {
            id: "Τρίψιμο και γυάλισμα μαρμάρων",
            label: "Τρίψιμο και γυάλισμα μαρμάρων",
            description:
              "Λείανση, στοκάρισμα και κρυσταλλοποίηση μαρμάρινων επιφανειών για αποκατάσταση λάμψης και καθαρότητας επιφάνειας.",
          },
          {
            id: "Τοποθέτηση πλακιδίων σε δάπεδο και τοίχους WC/Κουζίνας",
            label: "Τοποθέτηση πλακιδίων σε δάπεδο και τοίχους WC/Κουζίνας",
            description:
              "Προετοιμασία υποστρώματος, επικόλληση νέων πλακιδίων με κόλλα, αρμολόγηση και καθαρισμός.",
          },
        ],
      },
      {
        id: "Χρωματισμοί / Επιχρίσματα_5",
        title: "Χρωματισμοί / Επιχρίσματα",
        options: [
          {
            id: "Τοποθέτηση νέων κουφωμάτων αλουμινίου στα ίδια ανοίγματα",
            label: "Τοποθέτηση νέων κουφωμάτων αλουμινίου στα ίδια ανοίγματα",
            description:
              "Αποξήλωση παλαιών κουφωμάτων και τοποθέτηση νέων συστημάτων αλουμινίου (παράθυρα, μπαλκονόπορτες) με διπλούς υαλοπίνακες ασφαλείας.",
          },
        ],
      },
      {
        id: "Ξυλουργικές Εργασίες – Ντουλάπια / Έπιπλα_6",
        title: "Ξυλουργικές Εργασίες – Ντουλάπια / Έπιπλα",

        options: [
          {
            id: "Αντικατάσταση ξύλινων επιφανειών στην κουζίνα",
            label: "Αντικατάσταση ξύλινων επιφανειών στην κουζίνα",
            description: "",
          },
          {
            id: "Τοποθέτηση νέων εσωτερικών κουφωμάτων (πόρτες MDF/laminate)",
            label: "Τοποθέτηση νέων εσωτερικών κουφωμάτων (πόρτες MDF/laminate)",
            description: "",
          },
          {
            id: "Νέες ντουλάπες υπνοδωματίων",
            label: "Νέες ντουλάπες υπνοδωματίων",
            description: "",
          },
        ],
      },
      {
        id: "Χρωματισμοί / Επιχρίσματα_7",
        title: "Χρωματισμοί / Επιχρίσματα",

        options: [
          {
            id: "Εσωτερικοί χρωματισμοί",
            label: "Εσωτερικοί χρωματισμοί",
            description:
              "Στοκάρισμα και τρίψιμο επιφανειών, εφαρμογή αστάρι και δύο χεριών βαφή σε τοίχους και ταβάνια με πλαστικό ή ακρυλικό χρώμα.",
          },
          {
            id: "Εξωτερικοί χρωματισμοί",
            label: "Εξωτερικοί χρωματισμοί",
            description:
              "Στοκάρισμα και τρίψιμο επιφανειών, εφαρμογή αστάρι και δύο χεριών βαφή σε τοίχους και ταβάνια με πλαστικό ή ακρυλικό χρώμα.",
          },
        ],
      },
      {
        id: "Σκίαση / Εξοπλισμός_8",
        title: "Σκίαση / Εξοπλισμός",
        options: [
          {
            id: "Τοποθέτηση σκιάστρων / τεντών",
            label: "Τοποθέτηση σκιάστρων / τεντών",
            description:
              "Προμήθεια και τοποθέτηση τεντών ή σκιάστρων, με βραχίονες ή κάθετα συστήματα, χειροκίνητα ή ηλεκτροκίνητα. Στερέωση σε τοίχους ή οροφή με κατάλληλα στηρίγματα, τοποθέτηση κασετίνας όπου απαιτείται, ρύθμιση μηχανισμών κίνησης και δοκιμαστική λειτουργία. Δυνατότητα ενσωμάτωσης αισθητήρων (ήλιος–άνεμος) και αυτοματισμών για βελτιστοποίηση σκίασης.",
          },
        ],
      },
    ] : []),

    // This is subcategory 5 
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΔΑΧΤΥΛΙΔΙΩΝ_ΟΠΙΣΘΙΟΠΟΙΗΣΗΣ_ΙΟΚΘΕΙΑΣ_5"
    ) ? [
      {
        id: "Ικριώματα – Συμπληρωματικές Εργασίες",
        title: "Ικριώματα – Συμπληρωματικές Εργασίες",

        options: [
          {
            id: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
            label: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
            description:
              "Εγκατάσταση μεταλλικών ικριωμάτων κατά μήκος των όψεων, σύμφωνα με νομοθεσία περί μέτρων ασφαλείας. Διασφαλίζεται πλήρης και ασφαλής πρόσβαση για εργασίες αποκατάστασης και χρωματισμού.",
          },
        ],
      },

      {
        id: "Οικοδομικές–Δομικές Εργασίες",
        title: "Οικοδομικές – Δομικές Εργασίες",

        options: [
          {
            id: "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
            label:
              "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
            description:
              "Αποκατάσταση φθαρμένων ή αποσαθρωμένων επιχρισμάτων εξωτερικής τοιχοποιίας. Περιλαμβάνει καθαίρεση σαθρών επιχρισμάτων, εφαρμογή νέου σοβά, στοκάρισμα ρωγμών και λείανση επιφανειών, χωρίς επέμβαση στον φέροντα οργανισμό ή στη γεωμετρία του κτιρίου.",
          },
          {
            id: "Επισκευή και στερέωση μαρμάρινων στοιχείων (π.χ. περβαζιών, στηθαίων)",
            label: "Επισκευή και στερέωση μαρμάρινων στοιχείων (π.χ. περβαζιών, στηθαίων)",
            description:
              "Επαναστερέωση ή αντικατάσταση φθαρμένων/αποκολλημένων μαρμάρινων επιστρώσεων στις όψεις, με χρήση αγκυρίων ή κόλλας εξωτερικής χρήσης. Οι αρμοί σφραγίζονται με σιλικονούχα ή πολυουρεθανική μαστίχη για αποτροπή υγρασίας.",
          },
          {
            id: "Αποκατάσταση στοιχείων απορροής όμβριων και μεταλλικών εξαρτημάτων",
            label:
              "Αποκατάσταση στοιχείων απορροής όμβριων και μεταλλικών εξαρτημάτων",
            description:
              "Έλεγχος και αποκατάσταση ή αντικατάσταση φθαρμένων υδρορροών, στομίων, καναλιών ή σταγονόδρομων από λαμαρίνα ή συνθετικά υλικά. Στόχος η αποκατάσταση της λειτουργικής απορροής όμβριων και η προστασία των όψεων από υγρασία.",
          },
        ],
      },

      {
        id: "Χρωματισμοί / Επιχρίσματα_3",
        title: "Χρωματισμοί / Επιχρίσματα",

        options: [
          {
            id: "Εξωτερικοί χρωματισμοί επί των όψεων",
            label: "Εξωτερικοί χρωματισμοί επί των όψεων",
            description:
              "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
          },
          {
            id: "Χρωματισμός μεταλλικών κιγκλιδωμάτων (σιδηρών στοιχείων)",
            label: "Χρωματισμός μεταλλικών κιγκλιδωμάτων (σιδηρών στοιχείων)",
            description: "Καθαρισμός, αποσκουριάσμα και βαφή κιγκλιδωμάτων (κάγκελα, εξώστες, αυλόπορτες) με αντιδιαβρωτικό υπόστρωμα και δύο στρώσεις τελικής βαφής με χρώμα μετάλλου εξωτερικής χρήσης. Δεν μεταβάλλεται η μορφή ή ο χαρακτήρας του"
          },

        ],
      },
    ] : []),

    // This is subcategory 10 
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΝΕΑ_ΑΝΟΙΞΜΑΤΑ_ΕΠΙ_ΤΩΝ_ΟΙΚΕΩΝ_10"
    ) ? [
      {
        id: "Αποξηλώσεις / Καθαιρέσεις",
        title: "Αποξηλώσεις / Καθαιρέσεις",
        options: [
          {
            id: "Κατεδάφιση/Αποξήλωση Υφιστάμενων Τοιχοπληρώσεων (μη φερόντων στοιχείων)",
            label: "Κατεδάφιση/Αποξήλωση Υφιστάμενων Τοιχοπληρώσεων (μη φερόντων στοιχείων)",
            description:
              "Τοπική καθαίρεση τμημάτων εξωτερικών περιμετρικών τοιχοποιιών (οπτοπλινθοδομές ή άλλα υλικά πλήρωσης), χωρίς επέμβαση στον φέροντα οργανισμό (π.χ. δοκούς, υποστυλώματα).",
          },
        ],
      },

      {
        id: "Οικοδομικές–Δομικές Εργασίες",
        title: "Οικοδομικές – Δομικές Εργασίες",
        options: [
          {
            id: "Δημιουργία Νέων Ανοιγμάτων (Παράθυρα / Πόρτες / Βιτρίνες)",
            label:
              "Δημιουργία Νέων Ανοιγμάτων (Παράθυρα / Πόρτες / Βιτρίνες)",
            description:
              "Διάνοιξη νέων ανοιγμάτων με κατάλληλες λεπτομέρειες στήριξης και περιμετρικής ενίσχυσης (π.χ. γωνιόκρανα, μεταλλικά πλαίσια, αν χρειάζεται).Τοποθέτηση νέων κουφωμάτων(αλουμινίου, PVC ή ξύλου) στις νέες θέσεις.",
          },
          {
            id: "Μετατόπιση ή Τροποποίηση Υφιστάμενων Ανοιγμάτων",
            label: "Μετατόπιση ή Τροποποίηση Υφιστάμενων Ανοιγμάτων",
            description:
              "Κατάργηση ή μετατόπιση παλαιών κουφωμάτων.Επαναδιαμόρφωση του κελύφους με επισκευές τοιχοποιίας και αποκατάσταση επιχρισμάτων.",
          },
          {
            id: "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
            label:
              "Μικρές οικοδομικές εργασίες – Σοβατίσματα – Στοκαρίσματα τοιχοποιιών",
            description:
              "Αφορά την αποκατάσταση φθαρμένων ή αποσαθρωμένων επιχρισμάτων εξωτερικής τοιχοποιίας. Περιλαμβάνονται καθαίρεση σαθρών επιχρισμάτων, εφαρμογή νέου σοβά, στοκάρισμα ρωγμών και λείανση επιφανειών, χωρίς επέμβαση στον φέροντα οργανισμό ή στη γεωμετρία του κτιρίου.",
          },
        ],
      },

      {
        id: "Χρωματισμοί / Επιχρίσματα",
        title: "Χρωματισμοί / Επιχρίσματα",
        options: [
          {
            id: "Εξωτερικοί χρωματισμοί επί των όψεων",
            label: "Εξωτερικοί χρωματισμοί επί των όψεων",
            description:
              "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
          },
        ]
      },
    ] : []),

    // This is subcategory 14
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΛΙΜΑΚΑΣ_ΣΥΝΤΗΡΗΣΗ_ΚΑΙ_ΕΠΙΣΚΕΥΗ_ΣΤΕΓΩΝ_ΜΕ_ΧΡΗΣΗ_ΙΚΡΙΩΜΑ_14"
    ) ? [
      {
        id: "Ικριώματα – Συμπληρωματικές Εργασίες",
        title: "Ικριώματα – Συμπληρωματικές Εργασίες",
        options: [
          {
            id: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
            label: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
            description:
              "Εγκατάσταση μεταλλικών ικριωμάτων κατά μήκος των όψεων, σύμφωνα με τη νομοθεσία περί μέτρων ασφαλείας. Διασφαλίζεται ασφαλής και πλήρης πρόσβαση για εργασίες αποκατάστασης και χρωματισμού.",
          },
        ],
      },
      {
        id: "Αποξηλώσεις / Καθαιρέσεις",
        title: "Αποξηλώσεις / Καθαιρέσεις",
        options: [
          {
            id: "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
            label:
              "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
            description:
              "Αφαίρεση κεραμιδιών και παλιών υποστρωμάτων (π.χ. φύλλα ασφαλτικών μεμβρανών, ελαφρομπετά).",
          },
          {
            id: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
            label: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
            description:
              "Απομάκρυνση φθαρμένων εξαρτημάτων για αποκατάσταση της απορροής ομβρίων.",
          }
        ]
      },
      {
        id: "Οικοδομικές – Δομικές Εργασίες",
        title: "Οικοδομικές – Δομικές Εργασίες",
        options: [
          {
            id: "Έλεγχος & αποκατάσταση φθαρμένων υλικών",
            label:
              "Έλεγχος & αποκατάσταση φθαρμένων υλικών",
            description:
              "Ανίχνευση και αντικατάσταση φθαρμένων στοιχείων της στέγης (κεραμίδια, επικάλυψη, υδρορροές, στηρίγματα).",
          },
          {
            id: "Επισκευή φέροντος ξύλινου σκελετού",
            label: "Επισκευή φέροντος ξύλινου σκελετού",
            description:
              "Απομάκρυνση φθαρμένων εξαρτημάτων για αποκατάσταση της απορροής ομβρίων.",
          },
          {
            id: "Στεγανοποίηση – Υδατοστεγανότητα",
            label: "Στεγανοποίηση – Υδατοστεγανότητα",
            description: "Τοποθέτηση νέων μεμβρανών στεγανοποίησης, αντικατάσταση υδρορροών και σφράγιση κρίσιμων σημείων (π.χ. καμινάδες, φωταγωγοί).",
          }
        ]
      },
      {

        id: "Χρωματισμοί / Επιχρίσματα",
        title: "Χρωματισμοί / Επιχρίσματα",
        options: [
          {
            id: "Εξωτερικοί χρωματισμοί επί των όψεων",
            label: "Εξωτερικοί χρωματισμοί επί των όψεων",
            description:
              "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
          },
        ]
      },
      {
        id: "Στέγες – Συμπληρωματικές Εργασίες",
        title: "Στέγες – Συμπληρωματικές Εργασίες,",
        options: [
          {
            id: "Καθαρισμός υδρορροών & συστήματος απορροής",
            label: "Καθαρισμός υδρορροών & συστήματος απορροής",
            description:
              "Απομάκρυνση φερτών υλικών και σωμάτων από υδρορροές και υδροσυλλέκτες.",
          },
          {
            id: "Τοποθέτηση νέας επικάλυψης στέγης",
            label: "Τοποθέτηση νέας επικάλυψης στέγης",
            description:
              "Τοποθέτηση νέων κεραμιδιών ή άλλης εγκεκριμένης επικάλυψης, με σωστή στερέωση και εφαρμογή μεμβράνης.",
          },
          {
            id: "Εφαρμογή προστατευτικών επιστρώσεων",
            label: "Εφαρμογή προστατευτικών επιστρώσεων",
            description:
              "Τοπική ή συνολική εφαρμογή ελαστομερούς υδατοστεγανωτικής βαφής.",
          }
        ]
      },
    ] : []),

    // This is subcategory 2 
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΑΝΑΚΑΤΑΣΚΕΥΗ_ΥΠΕΡΗΧΩΝ_2"
    ) ? [
      {
        id: "Αποξηλώσεις / Καθαιρέσεις",
        title: "Αποξηλώσεις / Καθαιρέσεις",
        options: [
          {
            id: "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
            label:
              "Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών",
            description:
              "Αφαίρεση κεραμιδιών και παλιών υποστρωμάτων (π.χ. φύλλα ασφαλτικών μεμβρανών, ελαφρομπετά).",
          },
          {
            id: "Αποξήλωση υποστρώσεων επικάλυψης",
            label: "Αποξήλωση υποστρώσεων επικάλυψης",
            description:
              "Αφαίρεση υποστρώσεων (π.χ. παλιά ελαφρομπετά, φύλλα ασφαλτικών μεμβρανών κ.λπ.) όπου απαιτείται..",
          },
          {
            id: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
            label: "Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής",
            description:
              "Απομάκρυνση φθαρμένων εξαρτημάτων για αποκατάσταση της απορροής ομβρίων.",
          }
        ]
      },
      {
        id: "Οικοδομικές – Δομικές Εργασίες",
        title: "Οικοδομικές – Δομικές Εργασίες",

        options: [
          {
            id: "Επισκευή Φέροντος Ξύλινου Σκελετού",
            label:
              "Επισκευή Φέροντος Ξύλινου Σκελετού",
            description:
              "Αντικατάσταση σάπιων ή φθαρμένων τμημάτων (ζευκτών, τεγίδων, δοκαριών) χωρίς αλλαγή στη γεωμετρία και στη στατική δομή.Εφαρμογή αντισηπτικών και προστατευτικών υλικών στα νέα και στα υπάρχοντα ξύλινα στοιχεία.",
          },
          {
            id: "Στεγανοποίηση – Υδατοστεγανότητα",
            label: "Στεγανοποίηση – Υδατοστεγανότητα",
            description:
              "Εφαρμογή νέων ασφαλτικών μεμβρανών ή άλλων σύγχρονων υλικών στεγανοποίησης, στεγανοποίηση αρμών και κρίσιμων σημείων διέλευσης (π.χ. καμινάδες, φωταγωγοί), προσθήκη ή αντικατάσταση υδρορροών/καναλιών απορροής.",
          }
        ]
      },
      {
        id: "Χρωματισμοί / Επιχρίσματα",
        title: "Χρωματισμοί / Επιχρίσματα",
        options: [
          {
            id: "Εξωτερικοί χρωματισμοί επί των όψεων",
            label: "Εξωτερικοί χρωματισμοί επί των όψεων",
            description:
              "Πλήρης προετοιμασία και βαφή εξωτερικών επιφανειών με ακρυλικό ή σιλικονούχο χρώμα υψηλής αντοχής. Περιλαμβάνει καθαρισμό, αστάρωμα και εφαρμογή δύο στρώσεων τελικού χρώματος, με κατάλληλο υλικό ανάλογα με τις απαιτήσεις του υποστρώματος.",
          },
        ]
      },
      {
        id: "Στέγες – Συμπληρωματικές Εργασίες",
        title: "Στέγες – Συμπληρωματικές Εργασίες,",
        options: [
          {
            id: "Καθαρισμός υδρορροών & συστήματος απορροής",
            label: "Καθαρισμός υδρορροών & συστήματος απορροής",
            description:
              "Απομάκρυνση φερτών υλικών και σωμάτων από υδρορροές και υδροσυλλέκτες.",
          },
          {
            id: "Τοποθέτηση νέας επικάλυψης στέγης",
            label: "Τοποθέτηση νέας επικάλυψης στέγης",
            description:
              "Τοποθέτηση νέων κεραμιδιών ή άλλης εγκεκριμένης επικάλυψης, με σωστή στερέωση και εφαρμογή μεμβράνης.",
          },
          {
            id: "Εφαρμογή προστατευτικών επιστρώσεων",
            label: "Εφαρμογή προστατευτικών επιστρώσεων",
            description:
              "Τοπική ή συνολική εφαρμογή ελαστομερούς υδατοστεγανωτικής βαφής.",
          }
        ]
      },
    ] : []),

    // This is subcategory 7
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΕΡΜΟΠΡΟΖΩΗΣ_7"
    ) ? [
      {
        id: "Οικοδομικές – Δομικές Εργασίες",
        title: "Οικοδομικές – Δομικές Εργασίες",
        options: [
          {
            id: "Εξωτερική θερμομόνωση με διογκωμένη πολυστερίνη",
            label:
              "Εξωτερική θερμομόνωση με διογκωμένη πολυστερίνη",
            description:
              "Η εργασία αφορά την εφαρμογή εξωτερικής θερμομόνωσης στο κέλυφος του κτιρίου με πλάκες διογκωμένης πολυστερίνης (XPS) υψηλής πυκνότητας (≥30 kg/m³), πάχους 5–10 cm, σύμφωνα με τις απαιτήσεις του ΚΕΝΑΚ και της ΤΟΤΕΕ 20701-2/2017. Οι πλάκες επικολλούνται επί του υφιστάμενου υποστρώματος με τσιμεντοειδή κόλλα και επιπλέον στερεώνονται μηχανικά με πλαστικά βύσματα αγκύρωσης ανά 5 τεμάχια/m². Ακολουθεί εφαρμογή βασικής στρώσης οπλισμού με υαλόπλεγμα αλκαλίμαχο βάρους 160 g/m², ενσωματωμένο σε ρητινούχο κονίαμα πάχους περίπου 3 mm. Στις γωνίες, ανοίγματα και τελειώματα τοποθετούνται ειδικά προφίλ (γωνιόκρανα, νεροσταλάκτες, αρμοκάλυπτρα) για προστασία και ομοιομορφία. Ως τελική επιφάνεια εφαρμόζεται ακρυλικός ή σιλικονούχος σοβάς πάχους 1,5–2 mm, ανθεκτικός σε υπεριώδη ακτινοβολία και καιρικές καταπονήσεις, ώστε να εξασφαλίζεται υψηλή ενεργειακή απόδοση, στεγανότητα και αισθητική ομοιομορφία της όψης.",

          },
        ]
      },
      {

        id: "Συστήματα Παθητικής Ηλιακής Προστασίας και Ενεργειακής Αναβάθμισης Κελύφους",
        title: "Συστήματα Παθητικής Ηλιακής Προστασίας και Ενεργειακής Αναβάθμισης Κελύφους",
        options: [
          {
            id: "Εφαρμογή Παθητικών Ηλιακών Συστημάτων",
            label: "Εφαρμογή Παθητικών Ηλιακών Συστημάτων",
            description:
              "Τοποθέτηση σταθερών σκιάστρων (μεταλλικών ή ξύλινων) στις όψεις του κτιρίου και εφαρμογή ανακλαστικών επιστρώσεων σε δομικά στοιχεία ή σε υαλοστάσια (όπου απαιτείται), με στόχο τη βελτίωση της ενεργειακής απόδοσης και της θερμικής άνεσης.",
          },
        ]
      },
    ] : []),

    // This is subcategory 8
    ...(allSubmergedArray.includes(
      "ΑΔΕΙΑ_ΜΙΚΡΗΣ_ΚΑΙΜΑΚΑΣ_ΚΟΙΝΗ_ΔΡΑΣΗ_ΕΝΤΟΣ_ΟΙΚΟΠΕΔΟΥ_8"
    ) ? [
      {
        id: "Κοπή Δέντρων",
        title: "Κοπή Δέντρων",
        options: [
          {
            id: "Κοπή Δέντρων λόγω Στατικής Επικινδυνότητας",
            label: "Κοπή Δέντρων λόγω Στατικής Επικινδυνότητας",
            description: "Η εργασία αφορά την κοπή δέντρων τα οποία παρουσιάζουν έντονα φαινόμενα στατικής ανεπάρκειας, όπως σοβαρή κλίση, σήψη του κορμού ή αποσάθρωση του ριζικού τους συστήματος, γεγονός που αυξάνει τον κίνδυνο πτώσης και πιθανής πρόκλησης ζημιών σε γειτονικά κτίρια, κοινόχρηστους χώρους ή διερχόμενους.",
          },
          {
            id: "Κοπή Δέντρων λόγω Πρόκλησης Βλαβών σε Υποδομές και Δίκτυα",
            label: "Κοπή Δέντρων λόγω Πρόκλησης Βλαβών σε Υποδομές και Δίκτυα",
            description: "Η κοπή κρίνεται αναγκαία καθώς παρατηρούνται φαινόμενα ρηγματώσεων σε τοιχία περίφραξης, αποκόλληση πλακοστρώσεων και παραμορφώσεις δαπέδων, εξαιτίας της υπερβολικής ανάπτυξης του ριζικού συστήματος των δέντρων. Επιπλέον, έχουν καταγραφεί φθορές σε υπόγεια δίκτυα αποχέτευσης και ύδρευσης.",
          },
          {
            id: "Κοπή Δέντρων για Διασφάλιση Επαρκούς Φωτισμού και Αερισμού",
            label: "Κοπή Δέντρων για Διασφάλιση Επαρκούς Φωτισμού και Αερισμού",
            description: "Η εργασία αφορά την απομάκρυνση δέντρων που δημιουργούν σοβαρά προβλήματα σκίασης και παρεμπόδισης φυσικού αερισμού σε κύριους χώρους διαβίωσης εντός του κτιρίου, γεγονός που επηρεάζει αρνητικά την υγιεινή και την ποιότητα ζωής των ενοίκων, σε αντίθεση με τις απαιτήσεις του Κτιριοδομικού Κανονισμού.",
          },
          {
            id: "Κοπή Δέντρων λόγω Εκτέλεσης Εγκεκριμένων Οικοδομικών Εργασιών",
            label: "Κοπή Δέντρων λόγω Εκτέλεσης Εγκεκριμένων Οικοδομικών Εργασιών",
            description: "Η κοπή αφορά δέντρα που βρίσκονται εντός των ζωνών επέμβασης για προγραμματισμένες εργασίες μικρής κλίμακας, όπως η τοποθέτηση δεξαμενής, κατασκευή ράμπας ή άλλων βοηθητικών υποδομών. Η απομάκρυνσή τους είναι απαραίτητη για την ασφαλή και ορθή εκτέλεση των εργασιών.",
          },
          {
            id: "Κοπή Δέντρων για Πυροπροστασία",
            label: "Κοπή Δέντρων για Πυροπροστασία",
            description: "Η εργασία αφορά την απομάκρυνση δέντρων που βρίσκονται σε άμεση γειτνίαση με τα κτίρια του οικοπέδου, σε απόσταση μικρότερη των 3 έως 5 μέτρων από τα δομικά στοιχεία, όπως καθορίζεται από τις προβλέψεις του Κανονισμού Πυροπροστασίας Κτιρίων (ΦΕΚ 2434/Β/2018) και τις γενικές οδηγίες πυροπροστασίας της Πολιτικής Προστασίας.Η ανάγκη κοπής των συγκεκριμένων δέντρων τεκμηριώνεται λόγω της αυξημένης επικινδυνότητας πρόκλησης και εξάπλωσης πυρκαγιάς, ειδικά κατά τους θερινούς μήνες. Τα δέντρα αυτά, λόγω του μεγάλου ύψους, της πυκνής κόμης και της άμεσης επαφής με τις όψεις των κτιρίων, λειτουργούν ως πιθανός αγωγός φλόγας σε περίπτωση πυρκαγιάς, αυξάνοντας τον κίνδυνο μετάδοσης της φωτιάς από το έδαφος προς το κτίριο ή από κτίριο σε κτίριο.Επιπλέον, ορισμένα από τα δέντρα παρουσιάζουν συσσώρευση ξερών φύλλων, κλαδιών και οργανικών υπολειμμάτων τόσο στο ριζικό τους σύστημα όσο και εντός της κόμης τους, δημιουργώντας υψηλό φορτίο καύσιμης ύλης.Η απομάκρυνση των δέντρων αυτών εντάσσεται σε ευρύτερη στρατηγική προληπτικής πυροπροστασίας, η οποία περιλαμβάνει:Δημιουργία ελεύθερης ζώνης απαλλαγμένης από εύφλεκτη βλάστηση γύρω από τα κτίρια.Διασφάλιση της δυνατότητας πρόσβασης πυροσβεστικών μέσων σε περίπτωση ανάγκης.Ελαχιστοποίηση του κινδύνου φλόγας από έρπουσα ή υφέρπουσα πυρκαγιά.Συμμόρφωση με τις οδηγίες της Πυροσβεστικής Υπηρεσίας και τις απαιτήσεις των εγκεκριμένων μελετών πυροπροστασίας (όπου υπάρχουν).Η κοπή των δέντρων θα γίνει με κατάλληλα μέσα, με μέριμνα για την προστασία της ανθρώπινης ζωής, των γειτονικών κατασκευών και των παρακείμενων ιδιοκτησιών. Τα προϊόντα κοπής θα απομακρυνθούν άμεσα και θα διατεθούν σύμφωνα με τις ισχύουσες περιβαλλοντικές διατάξεις.",
          }
        ]
      },
    ] : []),
  ]);


  console.log(description, "all description==============")
  // i have removed the duplicate title here 
  description = description.filter(
    (item, index, self) =>
      index === self.findIndex((t) => t.title === item.title)
  );

  const navigate = useRouter();
  const dispatch = useDispatch();
  const aiExtractData = useSelector((state: RootState) => state.aiData);
  console.log("sub ", aiExtractData);
  const toggleOption = (categoryId: string, optionId: string) => {
    setDescription((prevCategories) =>
      prevCategories.map((category) =>
        category.id === categoryId
          ? {
            ...category,
            options: category.options.map((option) =>
              option.id === optionId
                ? { ...option, selected: !option.selected }
                : option
            ),
          }
          : category
      )
    );
  };

  //   const handleSave = () => {
  //     const selectedOptions: { [categoryId: string]: string[] } = {};
  //     description.forEach((category) => {
  //       const selected = category.options
  //         .filter((option) => option.selected)
  //         .map((option) => option.id);
  //       if (selected.length > 0) {
  //         selectedOptions[category.id] = selected;
  //       }
  //     });

  const handleSave = () => {
    const selectedOptions: {
      [categoryId: string]: { id: string; description?: string }[];
    } = {};
    description.forEach((cat) => {
      const selected = cat.options
        .filter((opt) => opt.selected)
        .map((opt) => ({ id: opt.id, description: opt.description }));
      if (selected.length > 0) {
        selectedOptions[cat.id] = selected;
      }
    });

    console.log("Selected options:", selectedOptions);
    dispatch(setMultipleDescriptionTask(selectedOptions));

    //Tahsin
    //need a validation here minimum one select
    navigate.push("/create-project");
  };

  return (
    <div className={`bg-[#F1F5F9] py-3  min-h-screen`}>
      <h2 className="text-3xl text-black font-semibold">Description Task</h2>
      <div className="grid grid-cols-1 lg:grid-cols-2 gap-8 mt-4">
        {/* Left Column */}
        <div className="space-y-6">
          {description
            .slice(0, Math.ceil(description.length / 2))
            .map((category) => (
              <div
                key={category.id}
                className=" rounded-lg  bg-white border p-5 border-primary"
              >
                <div className="flex items-center gap-3 mb-4">
                  <h2 className="text-lg font-semibold text-gray-900">
                    {category.title}
                  </h2>
                </div>

                <div className="space-y-3 ">
                  {category.options.map((option) => (
                    <SelectOption
                      key={option.id}
                      option={option}
                      categoryId={option.id}
                      toggleOption={() => toggleOption(category.id, option.id)}
                    />
                  ))}
                </div>
              </div>
            ))}
        </div>

        {/* Right Column */}
        <div className="space-y-6">
          {description
            .slice(Math.ceil(description.length / 2))
            .map((category) => (
              <div
                key={category.id}
                className=" rounded-lg p-5 bg-white border  border-primary"
              >
                <div className="flex items-center gap-3 mb-4">
                  <h2 className="text-lg font-semibold text-gray-900">
                    {category.title}
                  </h2>
                </div>

                <div className="space-y-3">
                  {category.options.map((option) => (
                    <SelectOption
                      key={option.id}
                      option={option}
                      categoryId={option.id}
                      toggleOption={() => toggleOption(category.id, option.id)}
                    />
                  ))}
                </div>
              </div>
            ))}
        </div>
      </div>

      {/* Save Button */}
      <div className="flex justify-end mt-8 w-fit ml-auto">
        <PrimaryButton label="Save & Continue" onClick={handleSave} />
      </div>
    </div>
  );
};

export default DescriptionTask;





