
"use client"

import StampComponent from "../../shared/signture/signture"

export default function F3D3() {

    return (
        <div className="max-w-[794px] mx-auto p-6 bg-white">
            {/* Title */}
            <h2 className="text-center font-semibold underline text-sm mb-2">
                ΤΕΧΝΙΚΗ ΕΚΘΕΣΗ ΕΡΓΑΣΙΩΝ - ΒΕΒΑΙΩΣΗ ΜΗΧΑΝΙΚΟΥ
            </h2>

            {/* Project Information */}
            <div className="mb-8 space-y-4">
                <div className="flex items-start justify-between max-w-[450px]">
                    <span className=" min-w-[80px] text-sm">Έργο:</span>
                    <h3 className=" text-sm">PROJECT DESCRIPTION</h3>
                </div>

                <div className="flex items-start justify-between gap-4 max-w-xl">
                    <span className=" text-sm">Θέση:</span>
                    <h3 className=" text-sm">ADDRESS, TOWN/AREA , POSTAL CODE ( FOR BUILDING)</h3>
                </div>

                <div className="flex items-start justify-between max-w-[400px] ml-[40px] text-sm">
                    <span className="">Ιδιοκτήτης:</span>
                    <h3 className=" text-sm">OWNER/OWNERS</h3>
                </div>
            </div>

            {/* Main Description */}
            <div className="text-sm mb-4 ml-10">
                <p>Στο ακίνητο <span className="font-semibold">Description for building/ horiontal property</span> επί της οδού <br /> <span className="font-semibold">Address,Town/Area , postal code ( FOR BUILDING),</span>
                    πρόκειται να <br /> εκτελεσθούν οι παρακάτω εργασίες :</p>
            </div>

            <div className="space-y-6 ml-10">
                <div>
                    <h3 className="text-sm font-bold"> ● Προμήθεια και Τοποθέτηση Λέβητα Φυσικού Αερίου</h3>
                    <p className="text-sm mb-6">
                        Προβλέπεται η τοποθέτηση επιτοίχιου λέβητα φυσικού αερίου (wall-hung), ισχύος 20kW – 30kW, με σήμανση CE και συμμόρφωση προς τα πρότυπα EN 15502 και τις απαιτήσεις του Κανονισμού Εσωτερικών Εγκαταστάσεων Φυσικού Αερίου (ΚΕΕΦΑ). Ο λέβητας θα τοποθετηθεί σε χώρο με επαρκή αερισμό, εντός ή εκτός του διαμερίσματος.
                    </p>
                </div>

                <div>
                    <h3 className="text-sm font-bold">● Κατασκευή Εσωτερικού Δικτύου Φυσικού Αερίου</h3>
                    <p className="underline text-sm">Εσωτερικό Δίκτυο (εντός διαμερίσματος):</p>
                    <p className="text-sm mb-6">
                        Η διανομή φυσικού αερίου στο εσωτερικό του διαμερίσματος θα πραγματοποιηθεί με χρήση πιστοποιημένων χαλκοσωλήνων ή πολυστρωματικών σωλήνων (π.χ. PE-AL-PE), με συνδέσεις και εξαρτήματα σύμφωνες με την ΤΟΤΕΕ 2421/86 και το ΕΛΟΤ EN 1775. Όλες οι ενώσεις θα είναι μηχανικές ή κολλητές, ανάλογα με το υλικό, και θα γίνουν με σεβασμό στις απαιτήσεις στεγανότητας και αντοχής.
                    </p>

                </div>
                <div>
                    <h3 className="text-sm font-bold">●  Κατασκευή Εξωτερικού Δικτύου Φυσικού Αερίου</h3>
                    <p className="underline text-sm">Εξωτερικό Δίκτυο (κοινόχρηστοι χώροι / όψεις):</p>
                    <p className="text-sm mb-4">
                        Το εξωτερικό δίκτυο σωληνώσεων από τον μετρητή φυσικού αερίου έως το διαμέρισμα θα κατασκευαστεί με γαλβανιζέ σωληνώσεις διαφόρων διατομών, ανάλογα με τις παροχετευτικές απαιτήσεις και τη διαδρομή. Οι σωλήνες θα είναι κατάλληλα στηριγμένοι με βάσεις και στηρίγματα μεταλλικής κατασκευής, προστατευμένοι από διάβρωση με επικάλυψη κατάλληλου αντισκωριακού υλικού (π.χ. ελαιοχρώματα κατάλληλα για γαλβανιζέ επιφάνειες).
                    </p>
                    <p className="text-sm mb-4">Η όδευση θα είναι εξωτερική, σε εμφανές σημείο, με τρόπο που να μην επηρεάζει την αρχιτεκτονική εικόνα του κτιρίου.</p>
                    <p className="text-sm mb-4">Όλες οι σωληνώσεις (εσωτερικές και εξωτερικές) θα υποβληθούν σε δοκιμές στεγανότητας και αντοχής πίεσης, όπως προβλέπεται από τη ΔΕΔΑ / ΕΔΑ Αττικής.</p>

                </div>

                <div>
                    <h3 className="text-sm font-bold">● Σύστημα Απαγωγής Καυσαερίων</h3>
                    <p className="text-sm mb-6">
                       Θα τοποθετηθεί ομόκεντρο σύστημα απαγωγής καυσαερίων, σύμφωνο με τις προδιαγραφές EN 14471, με έξοδο σε σημείο που τηρεί τις απαιτούμενες αποστάσεις ασφαλείας από ανοίγματα και όμορες ιδιοκτησίες. Όπου απαιτείται, θα γίνει προσαρμογή μήκους και διατομής των αγωγών, ώστε να διασφαλίζεται η ομαλή απαγωγή των καυσαερίων.
                    </p>

                </div>

                <div>
                    <h3 className="text-sm font-bold">● Δίκτυο Διανομής Θερμού Νερού Θέρμανσης
                    </h3>
                    <p className="text-sm mb-6">
                        Θα εγκατασταθούν σωληνώσεις τύπου PEX ή πολυστρωματικές, θερμομονωμένες, για τη μεταφορά θερμού νερού από τον λέβητα προς τα θερμαντικά σώματα. Προβλέπεται η τοποθέτηση κυκλοφορητή, δοχείου διαστολής, βαλβίδων ασφαλείας, καθώς και διατάξεων πλήρωσης και εκκένωσης του συστήματος.

                    </p>
                </div>

                <div>
                    <h3 className="text-sm font-bold">●Σύστημα Ελέγχου – Αυτονομία Θέρμανσης</h3>
                    <p className="text-sm mb-6">Θα εγκατασταθεί θερμοστάτης χώρου, με δυνατότητα ελέγχου της εσωτερικής θερμοκρασίας και προγραμματισμού λειτουργίας του λέβητα. Το σύστημα θα παρέχει πλήρη ενεργειακή αυτονομία.</p>

                </div>

                <div>
                    <h3 className="text-sm font-bold">● Πιστοποιήσεις – Δοκιμές Στεγανότητας και Ορθής Λειτουργίας</h3>
                    <p className="text-sm mb-6">
                        Στο πλαίσιο της ολοκλήρωσης των εργασιών εγκατάστασης του αυτόνομου συστήματος θέρμανσης με λέβητα φυσικού αερίου, θα πραγματοποιηθούν όλες οι απαιτούμενες δοκιμές ελέγχου στεγανότητας και ασφαλούς λειτουργίας του δικτύου αερίου και του συστήματος θέρμανσης.

                    </p>
                    <p className="text-sm mb-6">Αναλυτικά:</p>
                    <p className="text-sm mb-6">Θα διεξαχθεί δοκιμή στεγανότητας του δικτύου φυσικού αερίου, σύμφωνα με τις απαιτήσεις της ΤΟΤΕΕ 2421/86, του ΕΛΟΤ EN 1775, καθώς και τις οδηγίες της αρμόδιας Εταιρείας Διανομής Αερίου (ΕΔΑ Αττικής / ΔΕΔΑ), με χρήση αέρα υπό πίεση, σύμφωνα με τα πρωτόκολλα ελέγχου.</p>
                    <p className="text-sm mb-6">Θα εκδοθεί το απαιτούμενο Πιστοποιητικό Ελέγχου Στεγανότητας, υπογεγραμμένο από τον υπεύθυνο αδειούχο εγκαταστάτη αερίου.</p>
                    <p className="text-sm mb-6">Θα πραγματοποιηθεί έλεγχος σωστής καύσης, με τη χρήση κατάλληλου αναλυτή καυσαερίων, για τη διασφάλιση της ενεργειακής απόδοσης και της συμμόρφωσης στις περιβαλλοντικές προδιαγραφές εκπομπών.</p>
                    <p className="text-sm mb-6">Το σύστημα θέρμανσης (σωληνώσεις νερού και θερμαντικά σώματα) θα υποβληθεί σε υδραυλική δοκιμή στεγανότητας σύμφωνα με τις προδιαγραφές εγκατάστασης.</p>
                    <p className="text-sm mb-6">Τέλος, θα πραγματοποιηθεί δοκιμή λειτουργίας του συνολικού συστήματος, συμπεριλαμβανομένης της σωστής ρύθμισης του θερμοστάτη χώρου και της ενεργοποίησης του συστήματος αυτονομίας.</p>
                    <p className="text-sm mb-6">Όλες οι εργασίες δοκιμών και πιστοποιήσεων θα διεξαχθούν από αδειούχο και πιστοποιημένο τεχνικό προσωπικό, σύμφωνα με την ισχύουσα ελληνική και ευρωπαϊκή νομοθεσία.</p>
                </div>

                <div>
                    <h3 className="text-sm font-bold">Άρθρο 4, ΥΑ ΦΕΚ Β' 1843/2020</h3>
                </div>

                <div>
                    <h3 className="text-sm font-bold">1.Αντικείμενο Εργασιών:</h3>
                    <p className="text-sm mb-6">
                       Η παρούσα τεχνική έκθεση αφορά την εγκατάσταση αυτόνομου συστήματος θέρμανσης με χρήση επιτοίχιου λέβητα φυσικού αερίου μικρής ισχύος (wall-hung boiler) για την εξυπηρέτηση των θερμικών αναγκών του διαμερίσματος/οριζόντιας ιδιοκτησίας,σύμφωνα με τις προβλέψεις του άρθρου 4 της ΥΑ ΦΕΚ Β’ 1843/2020 και τις διατάξεις του Ν.4495/2017 περί έκδοσης Άδειας Μικρής Κλίμακας.
                    </p>
                </div>

                <div>
                    <h3 className="text-sm font-bold">2. Αναγκαιότητα Εργασιών</h3>
                    <p className="text-sm mb-6">
                        Η ανάγκη εκτέλεσης των εργασιών προκύπτει λόγω αναβάθμισης του συστήματος θέρμανσης της ιδιοκτησίας, ώστε να εξασφαλιστεί ενεργειακή αποδοτικότητα, μείωση του κόστους θέρμανσης και συμμόρφωση με τις απαιτήσεις ασφάλειας. Η εγκατάσταση νέου λέβητα φυσικού αερίου μικρής ισχύος θα γίνει εντός της ιδιοκτησίας, με πλήρη σεβασμό στις ισχύουσες τεχνικές προδιαγραφές και τους κανονισμούς ασφαλείας, ενώ προβλέπεται και η απαιτούμενη σύνδεση με το δίκτυο φυσικού αερίου. Επιπλέον, προβλέπεται η εκτέλεση των απαραίτητων εργασιών (σωληνώσεις, καμινάδα, αυτονομία, στεγανότητα) για τη λειτουργία του συστήματος.
                    </p>
                </div>

                <div>
                    <h3 className="text-sm font-bold">3. Δήλωση Συμμόρφωσης – Πολεοδομική Νομιμότητα</h3>
                    <p className="text-sm mb-6">Δηλώνεται ότι οι προτεινόμενες εργασίες:</p>
                    <p className="text-sm mb-6">
                        ● Δεν θίγουν ή τροποποιούν τον φέροντα οργανισμό του κτιρίου
                    </p>
                    <p className="text-sm mb-6">
                        ● Δεν αυξάνουν τον όγκο, το ύψος ή τη γεωμετρία του κτιρίου
                    </p>
                    <p className="text-sm mb-6">
                        ● Δεν μεταβάλλουν τις όψεις του κτιρίου
                    </p>
                    <p className="text-sm mb-6">
                        ● Δεν παραβιάζουν τις ισχύουσες πολεοδομικές διατάξεις
                    </p>
                    <p className="text-sm mb-6">
                        ● Δεν μεταβάλλουν τις όψεις του κτιρίου
                    </p>
                    <p className="text-sm mb-6 font-bold">
                        Εκτελούνται σύμφωνα με το άρθρο 29 του Ν.4495/2017 και το άρθρο 4 <br /> της ΥΑ ΦΕΚ Β’ 1843/2020.
                    </p>
                </div>
                {/* {/* Signature Section */}
                <div className="mt-6 text-right flex items-center justify-center p-5">
                    <div className="max-w-[300px]">

                        <div className="text-center">
                            <p>Ημερομηνία :</p>
                            <p>6/25/2025</p>
                        </div>
                        <div className="">
                            <h3 className="text-center mb-4">Ο ΜΗΧΑΝΙΚΟΣ</h3>
                            {/* Dashed Border Box = common component*/}
                            <StampComponent
                                title="ΣΦΡΑΓΙΔΑ ΜΗΧΑΝΙΚΟΥ"
                                instructions={[
                                    "Με δεξί κλικ",
                                    "Αλλαγή εικόνας",
                                    " Βάζετε την σφραγίδα σας",
                                ]}
                            />
                        </div>
                    </div>
                </div>

            </div>
        </div>
    )
}



