export const htkData = [
    {
        category: "Αποξηλώσεις",
        items: [
            {
                label: "",
                descriptions:
                    "Αφαίρεση υφιστάμενων εσωτερικών ή εξωτερικών κουφωμάτων (πόρτες, παράθυρα), αποσυναρμολόγηση κάσας, υαλοπινάκων και μηχανισμών, καθαρισμός ανοιγμάτων και αποκομιδή προϊόντων καθαίρεσης.",
            },
            {
                label: "Αποξήλωση πλακιδίων τοίχων",
                descriptions:
                    "Αφαίρεση επενδύσεων με κεραμικά πλακίδια σε τοίχους κουζίνας ή λουτρού, με προσοχή για αποφυγή φθορών στην τοιχοποιία. Περιλαμβάνει καθαρισμό υποστρώματος και προετοιμασία για νέα επένδυση.",
            },
            {
                label: "Αποξήλωση δαπέδων",
                descriptions:
                    "Καθαίρεση παλαιών επιστρώσεων δαπέδων (π.χ. πλακίδια, ξύλο, μάρμαρο, laminate), απομάκρυνση υπολειμμάτων κονιάματος και καθαρισμός υποστρώματος.",
            },
            {
                label: "Αποξήλωση ειδών υγιεινής",
                descriptions:
                    "Αφαίρεση λεκάνης, νιπτήρα, μπανιέρας, καμπίνας ντους και λοιπών ειδών υγιεινής, με ασφαλή αποσύνδεση υδραυλικών παροχών.",
            },
            {
                label: "Αποξήλωση κιγκλιδωμάτων",
                descriptions:
                    "Αφαίρεση κιγκλιδωμάτων μπαλκονιών, εξωστών ή κλιμάκων, χωρίς χρήση ικριωμάτων. Περιλαμβάνει φόρτωση και αποκομιδή.",
            },
        ],
    }
];