export const Services4DesData = [
    {
        category: "Αποξηλώσεις",
        items: [
            {
                label: "Αποξήλωση υφιστάμενων κουφωμάτων αλουμινίου ή ξύλινων",
                descriptions:
                    "Αφαίρεση υφιστάμενων εσωτερικών ή εξωτερικών κουφωμάτων (πόρτες, παράθυρα), αποσυναρμολόγηση κάσας, υαλοπινάκων και μηχανισμών, καθαρισμός ανοιγμάτων και αποκομιδή προϊόντων καθαίρεσης.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ε:",
                miniDescription2: "«Αντικατάσταση εσωτερικών ή εξωτερικών κουφωμάτων και υαλοπινάκων στο ίδιο άνοιγμα.»"
            },
            {
                label: "Αποξήλωση πλακιδίων δαπέδων και τοίχων με καθαρισμό υποστρώματος",
                descriptions:
                    "Αφαίρεση επενδύσεων με κεραμικά πλακίδια σε τοίχους κουζίνας ή λουτρού, με προσοχή για αποφυγή φθορών στην τοιχοποιία. Περιλαμβάνει καθαρισμό υποστρώματος και προετοιμασία για νέα επένδυση.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. β:",
                miniDescription2: "«Μικρής έκτασης εσωτερικές επισκευές ή διασκευές που δεν μεταβάλλουν τη φέρουσα κατασκευή του κτιρίου…»"
            },
            {
                label: "Αποξήλωση παλαιών επιστρώσεων δαπέδων κάθε τύπου",
                descriptions:
                    "Καθαίρεση παλαιών επιστρώσεων δαπέδων (π.χ. πλακίδια, ξύλο, μάρμαρο, laminate), απομάκρυνση υπολειμμάτων κονιάματος και καθαρισμός υποστρώματος.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. α:",
                miniDescription2: "«Εργασίες εσωτερικών χρωματισμών, μικρών επισκευών θυρών και παραθύρων ή μεμονωμένων επισκευών για λόγους χρήσης και υγιεινής, επισκευής ή αντικατάστασης δαπέδων.»"
            },
            {
                label: "Αποξήλωση ειδών υγιεινής και υδραυλικών εξαρτημάτων",
                descriptions:
                    "Αφαίρεση λεκάνης, νιπτήρα, μπανιέρας, καμπίνας ντους και λοιπών ειδών υγιεινής, με ασφαλή αποσύνδεση υδραυλικών παροχών.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. δ:",
                miniDescription2: "«Συντήρηση, επισκευή, διασκευή ή και τμηματική αντικατάσταση εγκαταστάσεων και αγωγών κτιρίων.»"
            },
            {
                label: "Αποξήλωση ντουλαπιών κουζίνας, πάγκων και ερμαρίων",
                descriptions:
                    "Αφαίρεση κιγκλιδωμάτων μπαλκονιών, εξωστών ή κλιμάκων, χωρίς χρήση ικριωμάτων. Περιλαμβάνει φόρτωση και αποκομιδή.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. γ:",
                miniDescription2: "«Εξωτερικοί χρωματισμοί ή αντικατάσταση κιγκλιδωμάτων ή επισκευή επιχρισμάτων ή επισκευή όψεων χωρίς χρήση ικριωμάτω"
            },
        ],
    },
    {
        category: " Χρωματισμοί – Επιχρίσματα",
        items: [
            {
                label: "Εσωτερικοί χρωματισμοί τοίχων, οροφών και κουφωμάτων",
                descriptions:
                    "Βαφή τοίχων και οροφών με πλαστικά ή ακρυλικά χρώματα, εφαρμογή αστάρι, στοκαρίσματος και τελικής στρώσης.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. α:",
                miniDescription2: "«Εργασίες εσωτερικών χρωματισμών, μικρών επισκευών θυρών και παραθύρων ή μεμονωμένων επισκευών για λόγους χρήσης και υγιεινής, επισκευής ή αντικατάστασης δαπέδων.»"
            },
            {
                label: "Εξωτερικοί χρωματισμοί όψεων χωρίς χρήση ικριωμάτων",
                descriptions:
                    "Βαφή όψεων με ακρυλικά ή σιλικονούχα χρώματα, καθαρισμός επιφανειών, χωρίς χρήση ικριωμάτων.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. γ:",
                miniDescription2: "«Εξωτερικοί χρωματισμοί ή αντικατάσταση κιγκλιδωμάτων ή επισκευή επιχρισμάτων ή επισκευή όψεων χωρίς χρήση ικριωμάτων.»"
            },
            {
                label: "Επισκευή ή αποκατάσταση επιχρισμάτων εξωτερικών τοίχωνΕπισκευή επιχρισμάτων",
                descriptions:
                    "Αποκατάσταση φθαρμένων ή αποκολλημένων επιχρισμάτων με κονιάματα, τοπικά μπαλώματα, χωρίς σκαλωσιές.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. γ:",
                miniDescription2: "«Εξωτερικοί χρωματισμοί ή αντικατάσταση κιγκλιδωμάτων ή επισκευή επιχρισμάτων ή επισκευή όψεων χωρίς χρήση ικριωμάτων.»"
            },
        ],
    },
    {
        category: "Δάπεδα – Επενδύσεις",
        items: [
            {
                label: "Αντικατάσταση υφιστάμενων δαπέδων με νέες επιστρώσεις πλακιδίων ή ξύλινων επενδύσεων",
                descriptions:
                    "Αποξήλωση υφιστάμενων επιστρώσεων και τοποθέτηση νέων (πλακίδια, ξύλο, μάρμαρο), με αρμολόγηση και τελική επεξεργασία.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. α:",
                miniDescription2: "«…επισκευής ή αντικατάστασης δαπέδων.»"
            },
            {
                label: "Τοποθέτηση πλακιδίων σε δάπεδα ή τοίχους με χρήση κόλλας τσιμεντοειδούς βάσης",
                descriptions:
                    "Τοποθέτηση νέων πλακιδίων σε χώρους υγιεινής ή κουζίνας, με προετοιμασία υποστρώματος και αρμολόγηση.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. β:",
                miniDescription2: "«Μικρής έκτασης εσωτερικές επισκευές ή διασκευές που δεν μεταβάλλουν τη φέρουσα κατασκευή του κτιρίου…»"
            },
            {
                label: "Διάστρωση ή διαμόρφωση δαπέδου ακάλυπτου χώρου έως το 1/3 της επιφάνειας",
                descriptions:
                    "Εργασίες διάστρωσης ή διαμόρφωσης δαπέδου ακάλυπτου χώρου έως το 1/3 της επιφάνειας, με κατασκευή υπόβασης από σκυρόδεμα ή 3Α και τελική επένδυση με πλακίδια, κυβόλιθους ή φυσική πέτρα. Περιλαμβάνει διαμόρφωση κλίσεων προς τα φρεάτια και αρμολογήσεις",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. α:",
                miniDescription2: "Διάστρωση ή διαμόρφωση δαπέδου ακάλυπτου χώρου έως το ένα τρίτο (1/3) της επιφάνειάς του»."
            },
        ],
    },
    {
        category: "Κουφώματα – Ξυλουργικά",
        items: [
            {
                label: "Αντικατάσταση εσωτερικών ή εξωτερικών κουφωμάτων στο ίδιο άνοιγμα",
                descriptions:
                    "Αποξήλωση παλαιών κουφωμάτων και τοποθέτηση νέων, χωρίς αλλαγή διαστάσεων.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ε:",
                miniDescription2: "«Αντικατάσταση εσωτερικών ή εξωτερικών κουφωμάτων και υαλοπινάκων στο ίδιο άνοιγμα.»"
            },
            {
                label: "Επισκευές κουφωμάτων",
                descriptions:
                    "Ρύθμιση μεντεσέδων, αντικατάσταση μηχανισμών, αλλαγή κλειδαριών.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. α:",
                miniDescription2: "«…μικρών επισκευών θυρών και παραθύρων…»"
            },
            {
                label: "Τοποθέτηση νέων ντουλαπιών κουζίνας και υπνοδωματίου",
                descriptions:
                    "Τοποθέτηση σταθερών κατασκευών (κουζινικά έπιπλα, ντουλάπες, πάγκο).",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ια:",
                miniDescription2: "«Τοποθέτηση ή εγκατάσταση εξοπλισμού σε κτίρια, όπως ντουλάπες και γλάστρες…»"
            },
        ],
    },
    {
        category: "Στέγες – Δώματα",
        items: [
            {
                label: "Συντήρηση ή αντικατάσταση επικάλυψης στέγης κεραμοσκεπής χωρίς χρήση ικριωμάτων",
                descriptions:
                    "Αντικατάσταση κεραμιδιών, στεγανοποιητικών μεμβρανών, υδρορροών, μικροεπισκευές.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. στ:",
                miniDescription2: "«Συντήρηση, επισκευή στεγών ή δωμάτων χωρίς χρήση ικριωμάτων.»"
            },
            {
                label: "Συντήρηση και αποκατάσταση μονώσεων δωμάτων με νέα στεγανωτική στρώση",
                descriptions:
                    "Τοπική αποκατάσταση ρωγμών, στεγανοποιήσεις, αντικατάσταση μονωτικών υλικών.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. στ:",
                miniDescription2: "«Συντήρηση, επισκευή στεγών ή δωμάτων χωρίς χρήση ικριωμάτων.»"
            },
        ],
    },
    {
        category: "Κατασκευές για ΑμεΑ / Εμποδιζόμενα Άτομα",
        items: [
            {
                label: "Κατασκευή ράμπας ΑμεΑ",
                descriptions:
                    "Διαμόρφωση κεκλιμένου επιπέδου για πρόσβαση ΑμεΑ, με χειρολισθήρες και αντιολισθηρά υλικά.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. β:",
                miniDescription2: "«…κατασκευές που απαιτούνται για τη μετακίνηση ή την κάθε μορφής εξυπηρέτηση των ατόμων με αναπηρία ή εμποδιζόμενων ατόμων.»"
            },
            {
                label: "Κατασκευή πεζουλιών / αντηρίδων",
                descriptions:
                    "Μικρές λιθοδομές, στηθαία ή αντηρίδες σε ακάλυπτους χώρους.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιδ:",
                miniDescription2: "«Κατασκευές, όπως σκάλες, κεκλιμένα επίπεδα (ράμπες), αντηρίδες και πεζούλια σε ακαλύπτους χώρους οικοπέδων και γηπέδων.»"
            },
        ],
    },
    {
        category: "Η/Μ Εγκαταστάσεις",
        items: [
            {
                label: "Ηλεκτρολογικές εγκαταστάσεις, επεκτάσεις γραμμών και συντηρήσεις ηλεκτρικών πινάκων",
                descriptions:
                    "Αντικατάσταση ή τμηματική επισκευή ηλεκτρικών κυκλωμάτων, καλωδιώσεων, φωτιστικών.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. δ:",
                miniDescription2: "«Συντήρηση, επισκευή, διασκευή ή και τμηματική αντικατάσταση εγκαταστάσεων και αγωγών κτιρίων.»"
            },
            {
                label: "Υδραυλικές εγκαταστάσεις, αντικαταστάσεις σωληνώσεων και επισκευές δικτύων",
                descriptions:
                    "Αποκατάσταση διαρροών, αλλαγή σωληνώσεων, αντικατάσταση βρυσών, σιφωνιών.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. δ:",
                miniDescription2: "«Συντήρηση, επισκευή, διασκευή ή και τμηματική αντικατάσταση εγκαταστάσεων και αγωγών κτιρίων.»"
            },
            {
                label: "Μηχανολογικές εγκαταστάσεις και συντηρήσεις συστημάτων εξαερισμού ή αντλιών",
                descriptions:
                    "Συντήρηση ή αντικατάσταση συστημάτων θέρμανσης/ψύξης.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. δ:",
                miniDescription2: "«Συντήρηση, επισκευή, διασκευή ή και τμηματική αντικατάσταση εγκαταστάσεων και αγωγών κτιρίων.»"
            },
            {
                label: "Τοποθέτηση και σύνδεση μονάδων κλιματισμού τύπου split ή VRV",
                descriptions:
                    "Εγκατάσταση εξωτερικών μονάδων κλιματισμού με ασφαλή στερέωση και σωληνώσεις.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. η:",
                miniDescription2: "«Τοποθέτηση κλιματιστικών και επιτοίχιων λεβήτων αερίου…»"
            },
            {
                label: "Εγκατάσταση αντλιών θερμότητας με υδραυλική διασύνδεση",
                descriptions:
                    "Τοποθέτηση αντλίας θερμότητας για θέρμανση/ψύξη χώρων, σύνδεση με δίκτυα.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. η:",
                miniDescription2: "«Τοποθέτηση κλιματιστικών και επιτοίχιων λεβήτων αερίου…»"
            },
            {
                label: "Τοποθέτηση ηλιακών θερμοσιφώνων σύμφωνα με άρθρο 19 ν.4067/12",
                descriptions:
                    "Εγκατάσταση ηλιακών συλλεκτών με δεξαμενή σε στέγη ή δώμα.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. θ:",
                miniDescription2: "«Τοποθέτηση ηλιακών θερμοσιφώνων, σύμφωνα με τις παρ. 2β και 2γ του άρθρου 19 του ν. 4067/2012.»"
            },
            {
                label: "Εγκατάσταση φωτοβολταϊκών συστημάτων έως 100 kW",
                descriptions:
                    "Τοποθέτηση Φ/Β συστημάτων σε δώματα ή στέγες, με inverter και παροχές.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ικ:",
                miniDescription2: "«Φωτοβολταϊκά συστήματα πάνω σε κτίρια και για ισχύ συστημάτων έως και 100kW.»"
            },
            {
                label: "Εγκατάσταση συστημάτων φυσικού αερίου, ρύθμισης και μέτρησης κατανάλωσης",
                descriptions:
                    "Εργασίες εγκατάστασης συστήματος φυσικού αερίου που περιλαμβάνει τοποθέτηση λεβητοστασίου, λεβήτων, καυστήρων, δικτύου σωληνώσεων, ρυθμιστών πίεσης και μετρητών κατανάλωσης. Περιλαμβάνονται οι συνδέσεις με το δίκτυο παροχής, οι δοκιμές στεγανότητας και η ρύθμιση λειτουργίας. Οι εργασίες εκτελούνται σύμφωνα με τα πρότυπα ΕΛΟΤ ΕΝ και τον Τεχνικό Κανονισμό Φυσικού Αερίου",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ικ:",
                miniDescription2: "«Τοποθέτηση κλιματιστικών και επιτοίχιων λεβήτων αερίου…»"
            },
            {
                label: "Εγκατάσταση συστημάτων Συμπαραγωγής Ηλεκτρισμού και Θερμότητας Υψηλής Απόδοσης (ΣΗΘΥΑ)",
                descriptions:
                    "Εργασίες εγκατάστασης συστημάτων Συμπαραγωγής Ηλεκτρισμού και Θερμότητας Υψηλής Απόδοσης (ΣΗΘΥΑ), που περιλαμβάνει τη θέση μονάδας συμπαραγωγής, λεβήτων, εναλλακτών θερμότητας, σωληνώσεων και ηλεκτρικών συνδέσεων. Περιλαμβάνονται οι εργασίες σύνδεσης με τα δίκτυα ηλεκτρικής ενέργειας και φυσικού αερίου, οι δοκιμές λειτουργίας και η ρύθμιση παραμέτρων απόδοσης. Οι εγκαταστάσεις εκτελούνται σύμφωνα με τον Τεχνικό Κανονισμό και τις προδιαγραφές ενεργειακής απόδοσης.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ικ:",
                miniDescription2: "«Τοποθέτηση κλιματιστικών και επιτοίχιων λεβήτων αερίου…»"
            },
        ],
    },
    {
        category: "Υπαίθριες Κατασκευές",
        items: [
            {
                label: "Κατασκευή πέργκολας έως 50 τ.μ",
                descriptions:
                    "Ξύλινη ή μεταλλική πέργκολα με σκίαστρα σε αυλές ή βεράντες.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιγ:",
                miniDescription2: "«Κατασκευή πέργκολας με ή χωρίς προσωρινά σκίαστρα επιφανείας έως πενήντα (50) τ.μ.…»"
            },
            {
                label: "Κατασκευή υπαίθριων τζακιών / BBQ",
                descriptions: "Κατασκευή μόνιμων εστιών με καπνοδόχο σε ακάλυπτους χώρους.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιβ:",
                miniDescription2: "«Κατασκευή εστιών, φούρνων και τζακιών με τις καπνοδόχους τους σε ακάλυπτους χώρους…»"
            },
            {
                label: "Κατασκευή εξωτερικών σκαλών",
                descriptions:
                    "Κατασκευή σκάλας από σκυρόδεμα ή μέταλλο σε ακάλυπτο.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιδ:",
                miniDescription2: "«Κατασκευές, όπως σκάλες, κεκλιμένα επίπεδα (ράμπες), αντηρίδες και πεζούλια…»"
            },
            {
                label: "Διαμορφώσεις εδάφους ±0,80 μ.",
                descriptions:
                    "Εκσκαφές/επιχώσεις μικρής κλίμακας για αυλές, χωρίς αλλοίωση φυσικής απορροής.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ζ και ιζ.",
                miniDescription2: ""
            },
            {
                label: "Περιφράξεις σε εκτός σχεδίου περιοχές",
                descriptions:
                    "Κατασκευή περιτοιχίσεων με συρματόπλεγμα ή τοιχία ύψους έως 3,5μ.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. κγ:",
                miniDescription2: "«Περιτοίχιση με χρήση οποιουδήποτε υλικού μέχρι ύψους τριάμισι (3,5) μέτρων…»"
            },
        ],
    },
    {
        category: "Σκίαση – Προστεγάσματα",
        items: [
            {
                label: "Τοποθέτηση σκιάστρων, περσίδων και προσωρινών στεγάστρων",
                descriptions:
                    "Εργασία τοποθέτησης μεταλλικών ή αλουμινένιων στοιχείων σκίασης (σκίαστρα, περσίδες, προσωρινά στέγαστρα) σε όψεις ή ακάλυπτους χώρους, για προστασία από τον ήλιο και τη βροχή, χωρίς μόνιμη θεμελίωση.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιγ:",
                miniDescription2: "τοποθέτηση προσωρινών σκιάστρων, περσίδων, προστεγασμάτων και τεντών,"
            },
            {
                label: " Κατασκευή πέργκολας με ή χωρίς κινητά ή σταθερά στοιχεία σκίασης έως 50 τ.μ.",
                descriptions: "Κατασκευή ελαφριάς μεταλλικής ή ξύλινης πέργκολας έως 50 τ.μ., με δυνατότητα προσθήκης σταθερών ή κινητών στοιχείων σκίασης, σύμφωνα με τις πολεοδομικές διατάξεις και χωρίς στεγασμένο χώρο.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιβ:",
                miniDescription2: "«Κατασκευή πέργκολας με ή χωρίς προσωρινά σκίαστρα επιφανείας έως πενήντα (50) τ.μ.…»"
            },
            {
                label: "Τοποθέτηση τεντών, προστεγασμάτων ή ηλιοπροστατευτικών πανιών",
                descriptions:
                    "Εργασία τοποθέτησης αναδιπλούμενων ή σταθερών τεντών, προστεγασμάτων ή πανιών ηλιοπροστασίας σε όψεις, μπαλκόνια ή ακάλυπτους χώρους, με μηχανικά ή χειροκίνητα συστήματα στήριξης.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. ιδ:",
                miniDescription2: "τοποθέτηση προσωρινών σκιάστρων, περσίδων, προστεγασμάτων και τεντών,"
            },
        ],
    },
    {
        category: "Σταθμοί – Υποδομές",
        items: [
            {
                label: "Κατασκευές ΣΜΑ (Σταθμοί Μεταφόρτωσης Απορριμμάτων)",
                descriptions:
                    "Διαμόρφωση χώρων, περίφραξη, ράμπες, πετάσματα, προκατασκευασμένοι οικίσκοι και δίκτυα.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. κδ:",
                miniDescription2: "«Εργασίες που απαιτούνται για την εγκατάσταση και λειτουργία Σταθμών Μεταφόρτωσης Απορριμμάτων (ΣΜΑ)…»"
            },
            {
                label: "Κατασκευή υπόγειων βάσεων εξοπλισμού",
                descriptions:
                    "Βάσεις από οπλισμένο σκυρόδεμα για Η/Μ εξοπλισμό υποσταθμών, έως 0,50 μ. από τη στάθμη εδάφους.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. κα:",
                miniDescription2: "«Κατασκευές υπόγειων βάσεων από οπλισμένο σκυρόδεμα για την έδραση ηλεκτρομηχανολογικού εξοπλισμού κάθε είδους…»"
            },
            {
                label: "Φορτιστές ηλεκτρικών οχημάτων",
                descriptions:
                    "Τοποθέτηση σταθμών φόρτισης ηλεκτρικών οχημάτων χωρίς ανάγκη νέου Μ/Σ.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. κβ:",
                miniDescription2: "«Κατασκευές για την εγκατάσταση υποδομής και τοποθέτηση συσκευών φόρτισης ηλεκτρικών οχημάτων…»"
            },
        ],
    },

    {
        category: "Μικρές Κατασκευές – Εξοπλισμός Χώρου",
        items: [
            {
                label: "Τοποθέτηση ντουλαπών, γλαστρών ή διαχωριστικών εξωστών",
                descriptions:
                    "Εργασία τοποθέτησης ελαφρών κατασκευών εξοπλισμού, όπως ντουλάπες αλουμινίου ή μεταλλικές, ζαρντινιέρες, διαχωριστικά ή προστατευτικά πετάσματα εξωστών, χωρίς μόνιμη στήριξη στο φέροντα οργανισμό.",
                miniDescription1: "άρθρο 30, Ν.4495/2017 παρ. ια",
                miniDescription2: "«Τοποθέτηση ή εγκατάσταση εξοπλισμού σε κτίρια, όπως ντουλάπες και γλάστρες, αλλαγή, τοποθέτηση ή και αφαίρεση διαχωριστικών στοιχείων εξωστών…»"
            },
            {
                label: "Τοποθέτηση διακοσμητικών στοιχείων, όπως πάγκοι, σιντριβάνια ή εικονοστάσια",
                descriptions:
                    " Εγκατάσταση ή κατασκευή μικρών διακοσμητικών στοιχείων εξωτερικού χώρου για αισθητική ή λειτουργική χρήση, χωρίς θεμελίωση ή μόνιμη δόμηση, σύμφωνα με την ισχύουσα νομοθεσία.",
                miniDescription1: "άρθρο 30, Ν.4495/2017 παρ. ια",
                miniDescription2: "«Τοποθέτηση ή εγκατάσταση εξοπλισμού σε κτίρια, όπως ντουλάπες και γλάστρες, αλλαγή, τοποθέτηση ή και αφαίρεση διαχωριστικών στοιχείων εξωστών…»"
            },
            {
                label: "Κατασκευή φούρνων, εστιών ή τζακιών με καπνοδόχο σε ακάλυπτους χώρους",
                descriptions:
                    "Κατασκευή τοιχοποιημένων ή μεταλλικών φούρνων και εστιών εξωτερικού χώρου με καπνοδόχο, σε σταθερή βάση, για οικιακή χρήση, με τήρηση των αποστάσεων ασφαλείας και τεχνικών προδιαγραφών.",
                miniDescription1: "άρθρο 30, ν.4495/2017 παρ. κβ:",
                miniDescription2: "«Κατασκευή εστιών, φούρνων και τζακιών με τις καπνοδόχους τους σε ακάλυπτους χώρους οικοπέδων ή γηπέδων…»"
            },
        ],
    },

      {
        category: "Παθητικά Ηλιακά Συστήματα – Καμινάδες",
        items: [
            {
                label: "Τοποθέτηση ή αντικατάσταση παθητικών ηλιακών συστημάτων",
                descriptions:
                    "Εργασίες τοποθέτησης ή αντικατάστασης παθητικών ηλιακών συστημάτων (π.χ. ηλιακοί συλλέκτες, θερμοσιφωνικά συστήματα, τοιχοποιίες τύπου Trombe) για βελτίωση της ενεργειακής απόδοσης του κτιρίου, σύμφωνα με τις ισχύουσες τεχνικές προδιαγραφές.",
                miniDescription1: "άρθρο 30, Ν.4495/2017 παρ. ι",
                miniDescription2: "«Εργασίες τοποθέτησης παθητικών ηλιακών συστημάτων ή αντικατάστασης εξωτερικών κουφωμάτων ή τοποθέτησης ή αντικατάστασης καμινάδων στις εξωτερικές όψεις υφιστάμενων κτιρίων, χωρίς χρήση ικριωμάτων…»"
            },
            {
                label: "Τοποθέτηση ή αντικατάσταση καμινάδων σε εξωτερικές όψεις",
                descriptions:
                    " Εργασίες εγκατάστασης ή αντικατάστασης μεταλλικών ή ανοξείδωτων καμινάδων στις εξωτερικές όψεις ή στέγες κτιρίων, με ασφαλή στερέωση και τήρηση των αποστάσεων από ανοίγματα και όμορα κτίρια.",
                miniDescription1: "άρθρο 30, Ν.4495/2017 παρ. ι",
                miniDescription2: "«Εργασίες τοποθέτησης παθητικών ηλιακών συστημάτων ή αντικατάστασης εξωτερικών κουφωμάτων ή τοποθέτησης ή αντικατάστασης καμινάδων στις εξωτερικές όψεις υφιστάμενων κτιρίων, χωρίς χρήση ικριωμάτων…»"
            },
        ],
    },
];
