"use client"

import StampComponent from "../../shared/signture/signture"

export default function F9D3() {

  return (
    <div className="max-w-[794px] mx-auto p-6 bg-white">
      {/* Title */}
      <h2 className="text-center font-semibold underline text-sm mb-2">
        ΙΔΙΩΤΙΚΗ ΣΥΜΒΑΣΗ ΙΔΙΟΚΤΗΤΩΝ
      </h2>

      {/* Project Information */}
      <div className="mb-8 space-y-4">
        <div className="text-center">
          <h3 className=" text-sm">ΓΙΑ ΛΕΙΤΟΥΡΓΙΚΗ ΣΥΝΕΝΩΣΗ ΟΜΟΡΩΝ ΚΤΙΡΙΩΝ / ΙΔΙΟΚΤΗΣΙΩΝ</h3>
        </div>
        <div className="mb-6">
          <h3 className="text-sm">1. Ιδιοκτήτης Α:</h3>
          <p className="text-sm">Ονοματεπώνυμο: ……………………………………</p>
          <p className="text-sm">ΑΦΜ: ……………………</p>
          <p className="text-sm">Δ/νση Κατοικίας: ……………………………………</p>
          <p className="text-sm">Ιδιότητα: Ιδιοκτήτης του ακινήτου που βρίσκεται επί της οδού ………………………… </p>
          <p className="text-sm">αριθ. …………, Δήμου ………………………, Τ.Κ …………, το οποίο αποτελεί το Κτίριο </p>
          <p className="text-sm">Α. </p>
        </div>
        <div className="mb-6">
          <h3 className="text-sm">2. Ιδιοκτήτης Β:</h3>
          <p className="text-sm">Ονοματεπώνυμο: ……………………………………</p>
          <p className="text-sm">ΑΦΜ: ……………………</p>
          <p className="text-sm">Δ/νση Κατοικίας: ……………………………………</p>
          <p className="text-sm">Ιδιότητα: Ιδιοκτήτης του ακινήτου που βρίσκεται επί της οδού ………………………… </p>
          <p className="text-sm">αριθ. …………, Δήμου ………………………, Τ.Κ …………, το οποίο αποτελεί το Κτίριο </p>
          <p className="text-sm">Β. </p>
        </div>
        <div className="mb-6">
          <h3 className="text-sm mb-2">Θέμα:</h3>
          <p className="text-sm">Συναίνεση για Λειτουργική Συνένωση Όμορων Ιδιοκτησιών / Κτιρίων</p>
        </div>
        <div className="mb-6">
          <h3 className="text-sm mb-2">Περιγραφή και Σκοπός της Συνένωσης:</h3>
        </div>
        <div className="mb-6">
          <p className="text-sm">Οι ανωτέρω ιδιοκτήτες, νομίμως κατέχοντες τα ακίνητα Κτίριο Α και Κτίριο Β, τα οποία είναι όμορα, δηλώνουν ρητά, υπεύθυνα και ανεπιφύλακτα ότι συναινούν στη λειτουργική συνένωση των δύο κτιρίων / ιδιοκτησιών, με σκοπό την ενοποίηση της χρήσης τους σε ενιαίο λειτουργικό χώρο, χωρίς όμως να επέρχεται οποιαδήποτε μεταβολή στα ποσοστά συνιδιοκτησίας, στη σύσταση οριζόντιας/κάθετης ιδιοκτησίας ή στον αριθμό των αυτοτελών ιδιοκτησιών του ακινήτου.</p>
        </div>
        <div className="mb-6">
          <h3 className="text-sm mb-6">Τεχνικά και Πολεοδομικά Χαρακτηριστικά της Παρέμβασης:</h3>
          <p className="text-sm">Η λειτουργική ένωση θα πραγματοποιηθεί αποκλειστικά μέσω επεμβάσεων σε μη φέροντα στοιχεία των κτιρίων, όπως διαμόρφωση / κατάργηση εσωτερικών τοίχων πλήρωσης, δημιουργία εσωτερικών ανοιγμάτων (π.χ. θυρών, τοξοειδών ανοιγμάτων κ.λπ.), χωρίς ουδεμία επέμβαση ή αλλοίωση στον φέροντα οργανισμό των κτιρίων.
            Δεν επέρχεται καμία μεταβολή στα κοινόχρηστα τμήματα ή στους κοινόχρηστους χώρους των ιδιοκτησιών.
            Δεν δημιουργείται καμία πρόσθετη δομημένη επιφάνεια, ούτε αλλάζει η χρήση των ιδιοκτησιών.
            Η παρούσα αφορά αποκλειστικά τη λειτουργική σύνδεση των χώρων, χωρίς πολεοδομική κατάργηση ή ενοποίηση ιδιοκτησιακών τίτλων.</p>
        </div>
        <div className="mb-6">
          <h3 className="text-sm mb-6">Νομική Συναίνεση – Δήλωση:</h3>
          <p className="text-sm">Οι συμβαλλόμενοι ιδιοκτήτες δηλώνουν υπεύθυνα και ρητά ότι συναινούν στην εκτέλεση των απαιτούμενων εργασιών λειτουργικής συνένωσης. Επιβεβαιώνουν ότι γνωρίζουν πως η λειτουργική συνένωση δεν επιφέρει καμία αλλαγή στους τίτλους ιδιοκτησίας, στα ποσοστά συνιδιοκτησίας επί του οικοπέδου, ούτε στις εγγραφές στο Κτηματολόγιο / Υποθηκοφυλακείο. Συμφωνούν ότι η παρούσα ιδιωτική σύμβαση υπογράφεται προκειμένου να χρησιμοποιηθεί αποκλειστικά για την υποστήριξη της σχετικής Άδειας Μικρής Κλίμακας, σύμφωνα με τις ισχύουσες πολεοδομικές διατάξεις και τη νομοθεσία.</p>
        </div>
        <div className="mb-6">
          <h3 className="text-sm mb-6">Η παρούσα σύμβαση συντάχθηκε σε δύο (2) πρωτότυπα, ένα για κάθε συμβαλλόμενο μέρος.</h3>
          <p className="text-sm mb-6">Οι Συμβαλλόμενοι Ιδιοκτήτες</p>
          <p className="text-sm mb-6">Ο Ιδιοκτήτης Α: ……………………………</p>
          <p className="text-sm mb-6">Ο Ιδιοκτήτης Β: ……………………………</p>
          <p className="text-sm">Ημερομηνία: …/…/2025</p>
        </div>
      </div>
    </div>
  )
}



