"use client"

import StampComponent from "../../shared/signture/signture"

interface allDataProps {
  owner_address: string;
  owner_city: string;
  owner_name: string;
  owner_postal_code: string;
  project_description?: string;
}

export default function F13D1({ allData }: { allData: allDataProps }) {
    
  const {
    owner_address,
    owner_city,
    owner_name,
    owner_postal_code,
    project_description,
  } = allData;

    return (
        <div className="max-w-[794px] mx-auto p-6 bg-white">
            {/* Title */}
            <h2 className="text-center font-semibold underline text-sm mb-2">
                ΤΕΧΝΙΚΗ ΕΚΘΕΣΗ ΕΡΓΑΣΙΩΝ - ΒΕΒΑΙΩΣΗ ΜΗΧΑΝΙΚΟΥ
            </h2>

            {/* Project Information */}
            <div className="mb-8 space-y-4">
                <div className="flex items-start justify-between">
                    <span className=" min-w-[80px] text-sm">Έργο:</span>
                    <h3 className=" text-sm">{project_description || "N/A"}</h3>
                </div>

                <div className="flex items-start justify-between gap-4 max-w-xl">
                    <span className=" text-sm">Θέση:</span>
                    <h3 className=" text-sm">{owner_address || "N/A"}, {owner_city || "N/A"} , {owner_postal_code || "N/A"} ( FOR BUILDING)</h3>
                </div>

                <div className="flex items-start justify-between max-w-[400px] ml-[40px] text-sm">
                    <span className="">Ιδιοκτήτης:</span>
                    <h3 className=" text-sm">{owner_name || "N/A"}</h3>
                </div>
            </div>

            {/* Main Description */}
            <div className="text-sm mb-4 ml-10">
                <p>Στο ακίνητο <span className="font-semibold">Description for building/ horiontal property</span> επί της οδού <br /> <span className="font-semibold">Address,Town/Area , postal code ( FOR BUILDING),</span>
                    πρόκειται να <br /> εκτελεσθούν οι παρακάτω εργασίες :</p>
            </div>

            {/* one  */}
            <div className="space-y-6 ml-10">
                <div>
                    <h1 className="text-sm font-semibold">● Χωματουργικές Εργασίες – Εκσκαφή Πίσinas</h1>
                    <p className="text-sm mb-6">
                        Οι χωματουργικές εργασίες αφορούν την εκσκαφή του εδάφους για τη
                        διαμόρφωση του σκάμματος της πίσινας, σύμφωνα με τις εγκριμένες μελέτες
                        και τις τεχνικές προδιαγραφές του έργου.
                    </p>
                    <p className="text-sm mb-6">
                        Η εκσκαφή θα εκτελείται σε βάθος και διαστάσεις που ορίζονται από τη
                        στατική και την αρχιτεκτονική μελέτη της πίσινας, λαμβάνοντας υπόψη τα
                        γεωτεχνικά χαρακτηριστικά του εδάφους, με στόχο την εξασφάλιση της
                        σταθερότητας των πρανών και την αποφυγή καθιζήσεων.
                    </p>
                    <h3 className="">Οι εργασίες θα περιλαμβάνουν:</h3>
                    <ul className="space-y-3 text-sm">
                        <li>Χάραξη και οριοθέτηση του σκάμματος με κατάλληλη σήμανση ασφάλειας</li>
                        <li>Απομάκρυνση φυτικής γης και ασταθών υλικών</li>
                        <li>Εκσκαφή με μηχανικά μέσα (εκσκαφείς - φορτωτές) με προσεκτική διαχείριση των προϊόντων εκσκαφής</li>
                        <li>Αποθήκευση ή απομάκρυνση των προϊόντων εκσκαφής, σύμφωνα με τις προβλέψεις της μελέτης και τις ισχύουσες περιβαλλοντικές διατάξεις</li>
                        <li>Λήψη προληπτικών μέτρων ασφαλείας για την στήριξη των πρανών, αν απαιτείται</li>
                    </ul>
                    <p className="text-sm">
                        Αναφορά σε Αρχαιολογικές Υπηρεσίες: Δεδομένου της φύσης του έργου και του βάθους εκσκαφής, καθώς και σύμφωνα με την ισχύουσα νομοθεσία (Ν. 3028/2002 “Ίδια την προστασία και ανάδειξη των Πολιτιστικών Κληρονομιών”), υπάρχει έγκριση εργασιών από την αρμόδια υπηρεσία.
                    </p>
                </div>
            </div>

            {/* two  */}
            <div className=" ml-10">
                <h1 className="text-sm font-semibold mt-[80px]">● Κατασκευή Οπλισμένου Σκυροδέματος – Πυθμένας Πίσinas</h1>
                <p className="text-sm mb-6">
                    Οι εργασίες περιλαμβάνουν τα εξής στάδια:
                </p>
                <ul className="space-y-4 text-sm">
                    <li>Καθαρισμός και προετοιμασία του σκάμματος εκσκαφής, εξασφαλίζοντας κατάλληλη βάση θεμέλιωσης.</li>
                    <li>Διαμόρφωση υπόβασης δαπέδου (στρώση καθαρότητας) με σκυρόδεμα κατηγορίας C12/15 ή αντίστοιχης.</li>
                    <li>Τοποθέτηση οπλισμού (χαλυβδινό ράβδο B500C ή B500A) για τον πυθμένα της πίσινας με τήρηση των απαιτήσεων επικαλύψεως και αγκυρώσεως, σύμφωνα με την τεχνική μελέτη.</li>
                    <li>Τοποθέτηση όλων των ενσωματωμένων στοιχείων, όπως τα ενωτικά εξαρτήματα αποχέτευσης (skimmers, φώτα πίσινας, στόμια αναρρόφησης-επιστροφής), πριν την έναρξη του σκυροδετήματος.</li>
                    <li>Κατασκευή διαστρωμάτων αρμών σκυροδέτησης σύμφωνα με τη χρήση ειδικών ταινιών αρμών (PVC waterstops) για αποφυγή διαρροής.</li>
                    <li>Έγχυση σκυροδέματος κατηγορίας C25/30 ή ανώτερης, ανάλογα με τη μελέτη, με μηχανική συμπύκνωση και απομάκρυνση κενών και φυσαλίδων.</li>
                    <li>Επιμέλεια επιφάνειας τελικής διαμόρφωσης, κατάλληλη για επόμενες φάσεις (υγροποιήσεις και επένδυση).</li>
                </ul>
            </div>

            {/* three */}
            <div className="pl-10 mt-[80px]">
                <h1 className="text-sm font-semibold">
                    ● Προδιαγραφές Κολυμβητικής Δεξαμενής έως 50 τ.μ
                </h1>
                <p className="text-sm">
                    Η εν λόγω κολυμβητική δεξαμενή βρίσκεται στον περιβάλλοντα χώρο του οικοπέδου, είναι «υπαίθρια» ιδιωτικής χρήσεως και έχει σχήμα παραλληλόγραμμο.
                    Οι διαστάσεις ειναι Α x B  και η επιφάνεια αυτής είναι .........μ2 και ανήκει στην κατηγορία των μικρών κολυμβητικών δεξαμενών (350 m2). O όγκος του νερού της πισίνας είναι ........... μ2 (μέσο βάθος 1,30-1,50m).
                    H κολυμβητική δεξαμενή είναι κατασκευασμένη ως εξής: Ό πυθμένας είναι από μπετόν και τα τοιχία από προκατασκευασμένα μεταλλικά πάνελ πού αντικαθιστούν το μπετόν ενώ οι τελικές επιφάνειες των πλευρικών τοιχωμάτων και του δαπέδου είναι καλυμμένες από μεμβράνη ( liner ) πάχους 75/100°.
                    Το βάθος νερού είναι 1,50m
                </p>
            </div>

            {/* four */}
            <div className="ml-10 mt-[80px]">
                <h1 className="text-sm font-semibold">
                    ● Τροφοδότηση της Κολυμβητικής Δεξαμενής
                </h1>
                <p className="text-sm">
                    Η τροφοδοσία της κολυμβητικής δεξαμενής με νερό θα πραγματοποιείται μέσω
                    σύνδεσης με το υφιστάμενο δίκτυο ύδρευσης της κατοικίας, σύμφωνα με τις
                    ισχυρούς υγειονομικές και τεχνικές διατάξεις.
                </p>
                <p className="text-sm">
                    Το σύστημα τροφοδότησης θα περιλαμβάνει:
                </p>
                <ul className="space-y-4 text-sm">
                    <li>Εγκατάσταση ασληνών κατάλληλης διατομής και υλικών (συνήθως πολυαιθυλένιο ΡΕ ή δίκτυο πολυαιθυλενίου PEX ή πολυπροπυλενίου ΡΡ-R).</li>
                    <li>Διακοπτικό όργανο (βάνες) στο σημείο τροφοδότησης, για έλεγχο και διακοπή της ροής, σύμφωνα με τις απαιτήσεις.</li>
                    <li>Τοποθέτηση ειδικής συσκευής μέτρησης ροής (backflow prevention device) για την αποφυγή επιστροφής νερού από την πίσινα στο δίκτυο πόσιμου νερού, όπως απαιτείται από τον Κανονισμό Ύδρευσης και τις Υγειονομικές Υπηρεσίες.</li>
                    <li>Σύνδεση με το μηχανοστάσιο της πίσινας, ώστε το νερό πλήρωσης να κυκλοφορεί μέσω ειδικής γραμμής και σε περίπτωση που απαιτείται, να υπάρχει ειδική παροχή (π.χ. ειδική γραμμή πλήρωσης ή ειδικό φίλτρο).</li>
                    <li>Πρόβλεψη ελέγχου/υδρομέτρησης (εφόσον ζητηθεί), ώστε να υπάρχει έλεγχος της κατανάλωσης νερού για την πίσινα.</li>
                </ul>
            </div>

            {/* five  */}
            <div className="mt-[80px] ml-10">
                <h1 className="text-sm font-semibold">
                    ● Σύστημα Εισροής - Εκροής - Εκκένωσης
                </h1>
                <p className="text-sm">
                    Η εκκένωση της δεξαμενής γίνεται σε χρόνο μικρότερο των 4 ωρών. Η αποχέτευση
                    της δεξαμενής γίνεται μέσω φρεατίου στο δίκτυο αποχέτευσης της κατοικίας.
                </p>
                <p className="text-sm">
                    Η πλήρωση της δεξαμενής γίνεται σε χρόνο .............. ωρών από το δίκτυο
                    ύδρευσης της κατοικίας μέσω αγωγού που καταλήγει στον χώρο καταθλιμμένων.
                </p>
                <h2 className="text-sm">
                    Κολυμβητική Πίσινα
                </h2>
                <p className="text-sm">
                    Έχουν εγκατασταθεί 4 άτομα εισόδου, περιμετρικά, σε βάθος 0,60m και σε
                    αποστάσεις μέχρι 2,0m μεταξύ τους. Τα στόμια είναι διαμέτρου 50mm
                    επιτρέποντας 1,5 m3/h για κάθε εισροή νερού στη σύμμειξη της παροχής.
                    Συνδέονται με αγωγούς προσφοράς με σωλήνα Φ63mm.
                </p>
                <p className="text-sm">
                    Το σύστημα εισροής κατασκευάστηκε έτσι ώστε να καλύπτει τουλάχιστον το
                    50% των ωρών της δεξαμενής και έχει τοποθετηθεί ένα φρεάτιο πλυμμένα
                    διαστάσεων 228 x 228mm στο δάπεδο της δεξαμενής.
                </p>
                <h2 className="text-sm font-semibold mt-12">
                    ● Skimmer
                </h2>
                <p className="text-sm">
                    Στην κολυμβητική δεξαμενή έχουν εγκατασταθεί τρία skimmer για την
                    απομάκρυνση της επιφανειακής ύλης μέσω του συστήματος φίλτρανσης. Το νερό
                    θα ανακυκλωθεί το 50% του νερού της δεξαμενής.
                </p>
                <p className="text-sm">
                    Στην επαναφορά του συστήματος φίλτρανσης εγκαταστάθηκε αυτόματος πλύσης
                    Bach Wash (αλλαγή της ροής του νερού στο φίλτρο για κατάλληλη διάταξη).
                </p>
            </div>

            {/* six  */}
            <div className="mt-[80px] ml-10">
                <h1 className="text-sm font-semibold">
                    ● Απολύμανση Νερού Κολυμβητικής Δεξαμενής με Μέθοδο Ηλεκτρόλυσης Άλατος
                </h1>
                <p className="text-sm">
                    Η απολύμανση του νερού της κολυμβητικής δεξαμενής θα γίνεται μέσω
                    συστήματος ηλεκτρόλυσης άλατος, μια σύγχρονη και φιλική προς το
                    περιβάλλον μέθοδο, η οποία εξασφαλίζει την απολύμανση χωρίς τη χρήση
                    χημικών προϊόντων.
                </p>
                <p className="text-sm">
                    Η διαδικασία περιλαμβάνει τα εξής στάδια:
                </p>
                <ul className="space-y-4 text-sm">
                    <li>Προσθήκη χλωριούχου νατρίου (κοινό άλας - NaCl) στο νερό της πίσινας, σε ποσότητα περίπου 5 kg/m³.</li>
                    <li>Το νερό, καθώς κυκλοφορεί στο σύστημα, ηλεκτρολύεται, διασπώντας το άλας σε ηλεκτρικούς πόλους και δημιουργώντας υποχλωριώδες νερό (NaOCl).</li>
                    <li>Το παραγόμενο υποχλωριώδες νερό λειτουργεί ως ισχυρό απολυμαντικό, καταστρέφοντας βακτήρια, μικροοργανισμούς και ρύπους του νερού της πίσινας.</li>
                    <li>Το υποχλωριώδες νερό αποστάζεται και επανέρχεται στο σύστημα μέσω ειδικού φίλτρου, εξασφαλίζοντας την κατάλληλη ποιότητα του νερού της πίσινας.</li>
                    <li>Η διαδικασία αυτή επιτρέπει τη διατήρηση της ποιότητας του νερού της πίσινας και τη συνεχιζόμενη απολύμανση, χωρίς την προσθήκη χημικών προϊόντων.</li>
                </ul>
            </div>

            {/* seven  */}
            <div className="ml-10 mt-[80px]">
                <h1 className="text-sm font-semibold">
                    ● Φωτισμός Κολυμβητικής Δεξαμενής
                </h1>
                <p className="text-sm">
                    Για την κάλυψη των αναγκών φωτισμού της κολυμβητικής δεξαμενής κατά
                    τις νυχτερές ώρες, προβλέπεται η εγκατάσταση τριών (3) υποβρύχιων
                    φωτιστικών σωμάτων τύπου LED, ισχύος 24W έκαστο, κατάλληλα για
                    λειτουργία σε υποβρύχιες συνθήκες.
                </p>
                <p className="text-sm my-4">
                    Τα φωτιστικά λειτουργούν με χαμηλή τάση 12V AC, η οποία επιτυγχάνεται
                    μέσω ειδικού μετασχηματιστή ασφαλείας ισχύος 150W, με είσοδο 230V AC
                    και έξοδο 12V AC, εξασφαλίζοντας την απαραίτητη ηλεκτροπληξία και
                    πυρασφάλεια σύμφωνα με τις τεχνικές προδιαγραφές ασφαλείας για
                    υποβρύχιες εγκαταστάσεις (EN 60598-2-18, EN 61439-1 κ.ά.).
                </p>
                <h2 className="text-sm mb-4">
                    Η ηλεκτρολογική εγκατάσταση περιλαμβάνει:
                </h2>
                <ul className="space-y-4 text-sm">
                    <li>Υποβρύχιο καλώδιο ειδικού τύπου (π.χ. H07RN-F ή αντίστοιχο), ανθεκτικό στις υπαίθριες συνθήκες.</li>
                    <li>Προστατευτικό μηχανικό σχέδιο ελέγχου, που θα περιλαμβάνει ασφάλειες και ρελέ διαφυγής ρεύματος (RCD) ευαισθησίας 30mA, για προστασία χρηστών και εξοπλισμού.</li>
                    <li>Στεγανή σωλήνα σύνδεσης, κατάλληλα για υπόθεση ή εξωτερική χρήση, σύμφωνα με τις απαραίτητες προστασίες IP.</li>
                    <li>Διακόπτες για ελεγχόμενη και/ή αυτοματοποιημένη, για την ενεργοποίηση και αποσύνδεση του φωτισμού.</li>
                </ul>
            </div>

            {/* eight  */}
            <div className="ml-10 mt-[80px]">
                <h1 className="text-sm font-semibold mb-4">
                    ● Εγκατάσταση Σωληνώσεων Κυκλοφορίας και Φιλτράνσης Πίσινας
                </h1>
                <p className="text-sm mb-6">
                    Η κυκλοφορία του νερού της κολυμβητικής δεξαμενής, καθώς και η σύνδεση όλων
                    των απαιτούμενων συστημάτων φίλτρανσης, αναρρόφησης, επαναφοράς και υπερχειλίσεως,
                    θα πραγματοποιηθεί μέσω δικτύου σωληνώσεων από πλαστικό υλικό PVC-U (Unplasticized Polyvinyl Chloride),
                    ειδικού τύπου για συστήματα ύδρευσης και πίσινας.
                </p>
                <p className="text-sm mb-6">
                    Οι σωληνώσεις θα έχουν αντοχή σε πίεση 10 bar (PN10) και θα είναι
                    πιστοποιημένες σύμφωνα με τα ευρωπαϊκά πρότυπα (EN 1452) ισοδύναμο για χρήση σε εγκαταστάσεις υπό πίεση.
                </p>
                <h2 className="text-sm mb-4">
                    Οι εργασίες θα περιλαμβάνουν:
                </h2>
                <ul className="space-y-4 text-sm">
                    <li>
                        Τοποθέτηση σωλήνων PVC-U PN10 κατάλληλης διατομής, ανάλογα με τις
                        απαιτήσεις παροχής του συστήματος (συνήθως διαμέτρους Φ50, Φ63, Φ75, Φ90 ή μεγαλύτερες ανάλογα με τη μελέτη).
                    </li>
                    <li>
                        Συνδέσεις με κόλληση (solvent cement welding) για τη πλήρη στεγανότητα και
                        αντοχή σε πίεση και χημικά πρόσθετα του νερού της πίσινας.
                    </li>
                    <li>
                        Εγκατάσταση απαραίτητων εξαρτημάτων (βάνες, μούφες, βάσεις, συνδέσεις κλπ.),
                        ανάλογα με τη γεωμετρία και τη λειτουργία του σωληνωτού δικτύου.
                    </li>
                    <li>
                        Πρόβλεψη βανών αποχέτευσης, για την εύκολη συντήρηση και επισκευή του
                        συστήματος και την αποφυγή των κυκλοφορούντων κόμβων.
                    </li>
                    <li>
                        Διαμόρφωση των δικτύων για χρήση με εξωτερική ή/και εσωτερική χρήση,
                        σύμφωνα με τις απαιτήσεις λειτουργίας και την προστασία από εξωτερικούς παράγοντες.
                    </li>
                    <li>
                        Όλα τα υλικά θα είναι κατασκευασμένα σε χλωριωμένο PVC, σύμφωνα με
                        τα πρότυπα ασφαλείας και τις ισχύουσες τεχνικές προδιαγραφές.
                    </li>
                </ul>
            </div>
            {/* nine  */}
            <div className="ml-10 mt-[80px]">
                <h1 className="text-sm font-semibold mb-4">
                    ● Σύστημα Ανακύκλωσης και Διήθησης Νερού Κολυμβητικής Δεξαμενής
                </h1>
                <p className="text-sm mb-6">
                    Αναλυτική Περιγραφή: <br /> Για τη διασφάλιση της σωστής ποιότητας και
                    καθαρότητας του νερού της κολυμβητικής δεξαμενής, έχει εγκατασταθεί ένα
                    αυτόματο, προκατασκευασμένο, compact πολυεστερικό συγκρότημα φίλτρανσης και
                    ανακυκλοφορίας, με συνολικές διαστάσεις 1,75m x 1,55m ύψος, εξοπλισμένο με
                    καταστροφή επιθέσεων και πρόσβασης.
                </p>
                <p className="text-sm mb-6">
                    Το σύστημα περιλαμβάνει:
                </p>
                <ul className="text-sm space-y-4">
                    <li>
                        -Προφίλτρο / Τριχοπαγίδα (hair & lint strainer): <br /> Στοιχείο
                        προστασίας της αντλίας, το οποίο παγιδεύει μεγάλα σωματίδια (λάδια, τρίχες
                        κ.λπ.), προτού το νερό εισέλθει στο αντλητικό σύστημα.
                    </li>
                    <li>
                        -Αντλία Κυκλοφορίας: <br /> Η αντλία έχει ισχύ 1,50HP και παρέχει
                        22m³/h, διαστασιολογημένη για να εξυπηρετεί το μέγεθος της δεξαμενής και
                        να εξασφαλίζει την απαιτούμενη συνεχιζόμενη ροή για όλη τη διάρκεια της
                        λειτουργίας, σύμφωνα με τις τεχνικές προδιαγραφές της μελέτης.
                    </li>
                    <li>
                        -Φίλτρο Διύλισης Τύπου Άμμου (Sand Filter): <br /> Φίλτρο
                        διύλισης τύπου άμμου για παροχή 22m³/h, κατάλληλο για την επίτευξη
                        απαιτήσεων ποιότητας προδιαγραφών νερού πισίνας.
                    </li>
                </ul>
                <p className="text-sm mb-6 mt-6">
                    -Το σύστημα περιλαμβάνει βαλβίδες πολλαπλών λειτουργιών (multiport valve) για
                    επιλογή λειτουργίας (φίλτρανση, backwash, rinse, κλπ.), μανομετρα για τον
                    έλεγχο της πίεσης λειτουργίας και σωληνώσεις κατάλληλων διατομών, σύμφωνα με
                    τις απαιτήσεις της εγκατάστασης.
                </p>
                <p className="text-sm mb-6">
                    -Ο ρυθμός ανακυκλοφορίας έχει υπολογιστεί ώστε να τηρεί τις
                    προβλέψεις της Υγειονομικής Διάταξης για τις ιδιωτικές πισίνες, εξασφαλίζοντας
                    την επαρκή διήθηση όλου του όγκου νερού μέσα σε χρόνο που δεν υπερβαίνει τις
                    μέγιστες επιτρεπόμενες τιμές (συνήθως 4-6 ώρες για ιδιωτικές πισίνες).
                </p>
            </div>
            
            {/* {/* Signature Section */}
            <div className="mt-6 text-right flex items-center justify-center p-5">
                <div className="max-w-[300px]">

                    <div className="text-center">
                        <p>Ημερομηνία :</p>
                        <p>25/06/2025</p>
                    </div>
                    <div className="">
                        <h3 className="text-center mb-4">Ο ΣΥΝΤΑΞΑΣ</h3>
                        {/* Dashed Border Box = common component*/}
                        <StampComponent
                            title="ΣΦΡΑΓΙΔΑ ΜΗΧΑΝΙΚΟΥ"
                            instructions={[
                                "Με δεξί κλικ",
                                "Αλλαγή εικόνας",
                                " Βάζετε την σφραγίδα σας",
                            ]}
                        />
                    </div>
                </div>
            </div>

        </div>
    )
}



