"use client"

import StampComponent from "../../shared/signture/signture"

interface allDataProps {
  owner_address: string;
  owner_city: string;
  owner_name: string;
  owner_postal_code: string;
  project_description?: string;
}

export default function F7D3({ allData }: { allData: allDataProps }) {
    
  const {
    owner_address,
    owner_city,
    owner_name,
    owner_postal_code,
    project_description,
  } = allData;

    return (
        <div className="max-w-[794px] mx-auto p-6 bg-white">
            {/* Title */}
            <h2 className="text-center font-semibold underline text-sm mb-2">
                ΤΕΧΝΙΚΗ ΕΚΘΕΣΗ ΕΡΓΑΣΙΩΝ - ΒΕΒΑΙΩΣΗ ΜΗΧΑΝΙΚΟΥ
            </h2>

            {/* Project Information */}
            <div className="mb-8 space-y-4">
                <div className="flex items-start justify-between">
                    <span className=" min-w-[80px] text-sm">Έργο:</span>
                    <h3 className=" text-sm">{project_description || "N/A"}</h3>
                </div>

                <div className="flex items-start justify-between gap-4 max-w-xl">
                    <span className=" text-sm">Θέση:</span>
                    <h3 className=" text-sm">{owner_address || "N/A"}, {owner_city || "N/A"}, {owner_postal_code || "N/A"} ( FOR BUILDING)</h3>
                </div>

                <div className="flex items-start justify-between max-w-[400px] ml-[40px] text-sm">
                    <span className="">Ιδιοκτήτης:</span>
                    <h3 className=" text-sm">{owner_name || "N/A"}</h3>
                </div>
            </div>

            {/* Main Description */}
            <div className="text-sm mb-4 ml-10">
                <p>Στο ακίνητο <span className="font-semibold">Description for building/ horiontal property</span> επί της οδού <br /> <span className="font-semibold">Address,Town/Area , postal code ( FOR BUILDING),</span>
                    πρόκειται να <br /> εκτελεσθούν οι παρακάτω εργασίες :</p>
            </div>

            <div className="space-y-6 ml-10">
                <div>
                    <h3 className="text-sm font-bold">
                        ● Ολοκληρωμένο Σύστημα Εξωτερικής Θερμομόνωσης με διογκωμένη πολυστερίνη και οργανικά έτοιμα επιχρίσματα
                    </h3>
                    <p className="text-sm">Το Ολοκληρωμένο Σύστημα Εξωτερικής Θερμομόνωσης αποτελείται από:
                    </p>
                    <p className="text-sm">Πιστοποιημένες θερμομονωτικές πλάκες γραφιτούχας διογκωμένης πολυστερίνης,(με συντελεστή θερμικής αγωγιμότητας λ=....... W/mK) και πάχους .... εκ. βάσει της μελέτης Ενεργειακής Απόδοσης του κτιρίου, για χρήση σε συστήματα εξωτερικής θερμομόνωσης. Οι θερμομονωτικές πλάκες πρέπει να εφαρμόζονται σε επίπεδη και καθαρή επιφάνεια απαλλαγμένη από σκόνες, βρωμιές και λίπη τοποθετημένες σταυρωτά (όπως η τουβλοδομή) εφαρμοσμένες στα δομικά στοιχεία με κόλλα υψηλής συγκολλητικής ικανότητας, κατάλληλης για ανόργανα υποστρώματα σύμφωνα με τις προδιαγραφές του συστήματος. Σε παλαιές βαμμένες επιφάνειες ή επιφάνειες ξηράς δόμησης η συγκόλληση επιτυγχάνεται με οργανική κόλλα ενδεικτικού τύπου
                    </p>
                    <p className="text-sm">Σε κάθε σημείο του κτιρίου όπου σταματά η θερμομόνωση (π.χ. στους λαμπάδες και τα πρέκια των κουφωμάτων, ποδιές παραθύρων κλπ.) χρησιμοποιείται η αυτοδιογκούμενη ταινία στεγάνωσης για να εξασφαλιστεί η στεγάνωση του συστήματος στα σημεία αυτά. Η ταινία τοποθετείται επί του σταθερού στοιχείου σύμφωνα με τα προβλεπόμενα από την μελέτη και πιέζεται επ' αυτού με την θερμομονωτική πλάκα. Για τη στερέωση και τη συγκράτηση του συστήματος της εξωτερικής θερμομόνωσης (θερμοπρόσοψη) με άλλα οικοδομικά στοιχεία θα απαιτηθούν ειδικές διατάξεις και ειδικά εξαρτήματα. Όλα τα προσκομιζόμενα υλικά θα είναι συσκευασμένα με σήμανση όπως προβλέπουν τα σχετικά πρότυπα και θα συνοδεύονται από επίσημα πιστοποιητικά συμμόρφωσης - επίδοσης από Διαπιστευμένο Φορέα.
                    </p>
                    <p className="text-sm">Σε κάθε σημείο του κτιρίου όπου σταματά η θερμομόνωση (π.χ. στους λαμπάδες και τα πρέκια των κουφωμάτων, ποδιές παραθύρων κλπ.) χρησιμοποιείται η αυτοδιογκούμενη ταινία στεγάνωσης για να εξασφαλιστεί η στεγάνωση του συστήματος στα σημεία αυτά. Η ταινία τοποθετείται επί του σταθερού στοιχείου σύμφωνα με τα προβλεπόμενα από την μελέτη και πιέζεται επ' αυτού με την θερμομονωτική πλάκα. Για τη στερέωση και τη συγκράτηση του συστήματος της εξωτερικής θερμομόνωσης (θερμοπρόσοψη) με άλλα οικοδομικά στοιχεία θα απαιτηθούν ειδικές διατάξεις και ειδικά εξαρτήματα. Όλα τα προσκομιζόμενα υλικά θα είναι συσκευασμένα με σήμανση όπως προβλέπουν τα σχετικά πρότυπα και θα συνοδεύονται από επίσημα πιστοποιητικά συμμόρφωσης - επίδοσης από Διαπιστευμένο Φορέα.
                    </p>
                    <p className="text-sm my-6">Οι θερμομονωτικές πλάκες θα πρέπει να είναι εναρμονισμένα με το πρότυπο ΕΝ 13163 : 2012 "Θερμομονωτικά προϊόντα κτιρίων Βιομηχανικά παραγόμενα προϊόντα από διογκωμένη ΤΕΧΝΙΚΗ ΠΕΡΙΓΡΑΦΗ 61 πολυστερίνη (xps)- προδιαγραφή". Ο συντελεστής θερμικής αγωγιμότητας λ της διογκωμένης πολυστερίνης θα πρέπει να αναγράφεται στην ετικέτα του προϊόντος.
                    </p>
                    <p className="text-sm">Οργανικός έτοιμος προς χρήση σοβάς σε μορφή πάστας, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824, κλάσης A2 σε αντίδραση στη φωτιά βάσει ΕΝ 13501, υψηλής ελαστικότητας, χωρίς τσιμέντο, με υψηλή αντοχή στις μηχανικές καταπονήσεις που επιτρέπει τον εμποτισμό υαλοπλέγματος για την πλήρη αντιρρηγματική προστασία του συστήματος με κατανάλωση ~2,8kg/m², ο οποίος απλώνεται ομοιόμορφα στο σύνολο της επιφάνειας των θερμομονωτικών πλακών και εντός του οποίου όσο είναι ακόμα υγρός εμβαπτίζεται υαλόπλεγμα, ανθεκτικό στα αλκάλια, σταθερών διαστάσεων, με μεγάλη ικανότητα απορρόφησης τάσεων (1700N/50mm), με επικάλυψη 10εκ στο σημείο συνάντησης των λωρίδων σύμφωνα με τις προδιαγραφές του συστήματος.
                    </p>
                    <p className="text-sm">Προετοιμασία λείας τελικής επικάλυψης, εφαρμόζοντας οργανικό έτοιμο προς χρήση σοβά χρωματισμένου στην μάζα του σύμφωνα με τις απαιτήσεις της μελέτης, εμπλουτισμένο με πρόσθετα για προστασία ενάντια σε άλγη και μύκητες, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824, σε κατανάλωση ~1,8kg/m².
                    </p>
                    <p className="text-sm">Ο τελικός σοβάς είναι ιδιαίτερα ελαστικός, ανθεκτικός σε μηχανικές καταπονήσεις, εξαιρετικά ανθεκτικός σε μικροοργανισμούς, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824 και κλάσης A2 σε αντίδραση στη φωτιά βάσει ΕΝ 13501, υψηλής υδρατμοδιαπερατότητας και υδροφοβίας.
                    </p>
                    <p className="text-sm">Τελική επικάλυψη με οργανικό λεπτόκοκκο έτοιμο προς χρήση σοβά σε κατανάλωση ~1,4 kg/m²., για δημιουργία λείων τελικών επιφανειών σε συστήματα εξωτερικής θερμομόνωσης, χρωματισμένο στην μάζα του σύμφωνα με τις απαιτήσεις της μελέτης, εμπλουτισμένο με πρόσθετα για προστασία ενάντια σε άλγη και μύκητες, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824 και κλάσης A2 σε αντίδραση στη φωτιά βάσει ΕΝ 13501..</p>
                </div>
                <div>
                    <h3 className="text-sm font-bold">● Εφαρμογή Παθητικών Ηλιακών Συστημάτων
                    </h3>
                    <p className="text-sm">Στο πλαίσιο της βελτίωσης της ενεργειακής απόδοσης και της θερμικής άνεσης, προβλέπεται η εφαρμογή παθητικών ηλιακών συστημάτων όπως:
                    </p>
                    <p className="my-6 text-sm">-Τοποθέτηση σταθερών σκιάστρων (μεταλλικών ή ξύλινων) στις όψεις του κτιρίου.
                    </p>
                    <p className="my-6 text-sm">-Εφαρμογή ανακλαστικών επιστρώσεων σε δομικά στοιχεία ή σε υαλοστάσια (όπου απαιτείται).</p>
                </div>
                {/* {/* Signature Section */}
                <div className="mt-6 text-right flex items-center justify-center p-5">
                    <div className="max-w-[300px]">

                        <div className="text-center">
                            <p>Ημερομηνία :</p>
                            <p>6/25/2025</p>
                        </div>
                        <div className="">
                            <h3 className="text-center mb-4">Ο ΜΗΧΑΝΙΚΟΣ</h3>
                            {/* Dashed Border Box = common component*/}
                            <StampComponent
                                title="ΣΦΡΑΓΙΔΑ ΜΗΧΑΝΙΚΟΥ"
                                instructions={[
                                    "Με δεξί κλικ",
                                    "Αλλαγή εικόνας",
                                    " Βάζετε την σφραγίδα σας",
                                ]}
                            />
                        </div>
                    </div>
                </div>

            </div>
        </div>
    )
}



